
// មាត្រា
type Article = {
  index: number,
  content: string
}

type Chapter = {
  index: number,
  name: string,
  articles: Article[]
}

type Legislation = {
  index: number,
  name: string,
  chapters: Chapter[]
}

export const legislation_1: Legislation = {
  index: 1,
  name: `រដ្ឋធម្មនុញ្ញនៃព្រះរាជាណាចក្រកម្ពុជា`,
  chapters: [
    {
      index: 1,
      name: `អំពីអធិបតេយ្យ`,
      articles: [
        {
          index: 1,
          content: `
          ប្រទេសកម្ពុជា ជាព្រះរាជាណាចក្រ ដែលព្រះមហាក្សត្រ ទ្រង់ ប្រតិបត្តិតាមរដ្ឋធម្មនុញ្ញ និងតាមលទ្ធិប្រជាធិបតេយ្យ សេរីពហុបក្ស។ ព្រះរាជាណាចក្រកម្ពុជា ជារដ្ឋឯករាជ្យ អធិបតេយ្យ សន្តិភាព អព្យាក្រឹត អចិន្ត្រៃយ៍ មិនចូលបក្សសម្ព័ន្ធ ។
          `
        },
        {
          index: 2,
          content: `
          បូរណភាពទឹកដីរបស់ព្រះរាជាណាចក្រកម្ពុជាមិនអាចរំលោភបាន ដាច់ខាត ក្នុងព្រំដែនរបស់ខ្លួន ដែលមានកំណត់ក្នុងផែនទីខ្នាត ១/១០០.០០០ ធ្វើនៅចន្លោះឆ្នាំ ១៩៣៣-១៩៥៣ ហើយដែលត្រូវបានទទួលស្គាល់ជា អន្តរជាតិ នៅចន្លោះឆ្នាំ ១៩៦៣-១៩៦៩ ។
          `
        },
        {
          index: 3,
          content: `
          ព្រះរាជាណាចក្រកម្ពុជា ជារដ្ឋដែលមិនអាចបំបែកបាន ។
          `
        },
        {
          index: 4,
          content: `
          បាវចនានៃព្រះរាជាណាចក្រកម្ពុជាគឺៈ ជាតិ សាសនា ព្រះមហាក្សត្រ។
          `
        },
        {
          index: 5,
          content: `
          ភាសា និងអក្សរដែលប្រើជាផ្លូវការគឺ ភាសា និងអក្សរខ្មែរ ។
          `
        },
      ]
    }
  ]

}