module Data.Article exposing (..)


type alias Article =
    { index : Int
    , isNew : Bool
    , content : String
    , referenceNumber : Int
    , chapterIndex : Int
    , tags : List String
    }


colors =
    [ "bg-[#696969]"
    , "bg-[#9ACD32]"
    , "bg-[#DA70D6]"
    , "bg-[#32CD32]"
    , "bg-[#4682B4]"
    , "bg-[#DAA520]"
    , "bg-[#E9967A]"
    , "bg-[#BA55D3]"
    , "bg-[#5F9EA0]"
    , "bg-[#B8860B]"
    , "bg-[#2F4F4F]"
    , "bg-[#C71585]"
    , "bg-[#FF6347]"
    , "bg-[#00FF00]"
    , "bg-[#8FBC8F]"
    , "bg-[#1E90FF]"
    , "bg-[#BDB76B]"
    , "bg-[#008000]"
    , "bg-[#008B8B]"
    , "bg-[#9932CC]"
    , "bg-[#66CDAA]"
    , "bg-[#A0522D]"
    , "bg-[#DC143C]"
    , "bg-[#00BFFF]"
    , "bg-[#0000CD]"
    , "bg-[#CD5C5C]"
    , "bg-[#006400]"
    , "bg-[#3CB371]"
    , "bg-[#6B8E23]"
    , "bg-[#00FF7F]"
    , "bg-[#FF4500]"
    , "bg-[#800000]"
    , "bg-[#4B0082]"
    , "bg-[#808000]"
    , "bg-[#663399]"
    , "bg-[#D2691E]"
    , "bg-[#8B0000]"
    , "bg-[#FF1493]"
    , "bg-[#A9A9A9]"
    , "bg-[#00CED1]"
    , "bg-[#FFA500]"
    , "bg-[#7B68EE]"
    , "bg-[#A52A2A]"
    , "bg-[#B22222]"
    , "bg-[#008080]"
    , "bg-[#DB7093]"
    , "bg-[#48D1CC]"
    , "bg-[#808080]"
    , "bg-[#8B4513]"
    , "bg-[#CD853F]"
    , "bg-[#00008B]"
    , "bg-[#8B008B]"
    , "bg-[#191970]"
    , "bg-[#FF00FF]"
    , "bg-[#6495ED]"
    , "bg-[#FF0000]"
    , "bg-[#40E0D0]"
    , "bg-[#000000]"
    , "bg-[#9400D3]"
    , "bg-[#FF69B4]"
    , "bg-[#8A2BE2]"
    , "bg-[#800080]"
    , "bg-[#778899]"
    , "bg-[#708090]"
    , "bg-[#00FA9A]"
    , "bg-[#556B2F]"
    , "bg-[#F08080]"
    , "bg-[#FF7F50]"
    , "bg-[#483D8B]"
    , "bg-[#20B2AA]"
    , "bg-[#2E8B57]"
    , "bg-[#FF8C00]"
    , "bg-[#9370DB]"
    , "bg-[#0000FF]"
    , "bg-[#000080]"
    , "bg-[#228B22]"
    , "bg-[#EE82EE]"
    , "bg-[#BC8F8F]"
    , "bg-[#FA8072]"
    , "bg-[#6A5ACD]"
    , "bg-[#4169E1]"
    ]


articles : List Article
articles =
    [ { index = 1
      , isNew = False
      , content = "ប្រទេសកម្ពុជា ជាព្រះរាជាណាចក្រ ដែលព្រះមហាក្សត្រ ទ្រង់ប្រតិបត្តិតាមរដ្ឋធម្មនុញ្ញ និងតាមលទ្ធិប្រជាធិបតេយ្យ សេរីពហុបក្ស។\n\nព្រះរាជាណាចក្រកម្ពុជា ជារដ្ឋឯករាជ្យ អធិបតេយ្យ សន្តិភាព អព្យាក្រឹត អចិន្ត្រៃយ៍ មិនចូលបក្សសម្ព័ន្ធ។"
      , referenceNumber = 0
      , chapterIndex = 1
      , tags = [ "🇰🇭" ]
      }
    , { index = 2
      , isNew = False
      , content = "បូរណភាពទឹកដីរបស់ព្រះរាជាណាចក្រកម្ពុជាមិនអាចរំលោភបាន ដាច់ខាត ក្នុងព្រំដែនរបស់ខ្លួន ដែលមានកំណត់ក្នុងផែនទីខ្នាត ១/១០០.០០០ ធ្វើនៅចន្លោះឆ្នាំ ១៩៣៣-១៩៥៣ ហើយដែលត្រូវបានទទួលស្គាល់ជា អន្តរជាតិ នៅចន្លោះឆ្នាំ ១៩៦៣-១៩៦៩។"
      , referenceNumber = 0
      , chapterIndex = 1
      , tags = [ "🇰🇭" ]
      }
    , { index = 3
      , isNew = False
      , content = "ព្រះរាជាណាចក្រកម្ពុជា ជារដ្ឋដែលមិនអាចបំបែកបាន។"
      , referenceNumber = 0
      , chapterIndex = 1
      , tags = [ "🇰🇭" ]
      }
    , { index = 4
      , isNew = False
      , content = "បាវចនានៃព្រះរាជាណាចក្រកម្ពុជាគឺៈ ជាតិ សាសនា ព្រះមហាក្សត្រ។"
      , referenceNumber = 0
      , chapterIndex = 1
      , tags = [ "🇰🇭", "☸️", "👑" ]
      }
    , { index = 5
      , isNew = False
      , content = "ភាសា និងអក្សរដែលប្រើជាផ្លូវការគឺ ភាសា និងអក្សរខ្មែរ។"
      , referenceNumber = 0
      , chapterIndex = 1
      , tags = [ "🇰🇭", "✍️" ]
      }
    , { index = 6
      , isNew = False
      , content = "ភ្នំពេញជារាជធានីនៃព្រះរាជាណាចក្រកម្ពុជា។\n\nទង់ជាតិ ភ្លេងជាតិ និងសញ្ញាជាតិ មានកំណត់នៅក្នុង ឧបសម្ព័ន្ធ ១,២ និង ៣។"
      , referenceNumber = 0
      , chapterIndex = 1
      , tags = [ "🇰🇭", "🎵", "🏘️" ]
      }
    , { index = 7
      , isNew = False
      , content = "ព្រះមហាក្សត្រកម្ពុជា ទ្រង់គ្រងរាជ្យសម្បត្តិ ប៉ុន្តែទ្រង់មិនកាន់ អំណាចឡើយ។\n\nព្រះមហាក្សត្រ ទ្រង់ជាព្រះប្រមុខរដ្ឋមួយជីវិត។\n\nអង្គព្រះមហាក្សត្រមិនអាចនរណារំលោភបំពានបានឡើយ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑", "🪑" ]
      }
    , { index = 8
      , isNew = False
      , content = "ព្រះមហាក្សត្រព្រះអង្គទ្រង់ជានិមិត្តរូបនៃឯកភាពជាតិ និងនិរន្តរភាពជាតិ។\n\nព្រះមហាក្សត្រ ទ្រង់ជាអ្នកធានាឯករាជ្យជាតិ អធិបតេយ្យ និងបូរណភាពទឹកដីនៃព្រះរាជាណាចក្រកម្ពុជា ទ្រង់ជាអ្នកធានាការគោរពសិទ្ធិ និងសេរីភាពរបស់ប្រជាពលរដ្ឋ និងការគោរពសន្ធិសញ្ញាអន្តរជាតិ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑", "🛡️" ]
      }
    , { index = 9
      , isNew = False
      , content = "ព្រះមហាក្សត្រទ្រង់មានតួនាទីខ្ពង់ខ្ពស់ជាអាជ្ញាកណ្តាលដើម្បីធានាការប្រព្រឹត្តទៅនៃអំណាចសាធារណៈឱ្យមានភាពទៀងទាត់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑", "🕊️" ]
      }
    , { index = 10
      , isNew = False
      , content = "របបរាជានិយមកម្ពុជា ជារបបជ្រើសតាំង។\n\nព្រះមហាក្សត្រ ទ្រង់ឥតមានព្រះរាជអំណាចចាត់តាំងព្រះរជ្ជទាយាទ សម្រាប់គ្រងរាជ្យសម្បត្តិឡើយ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "🇰🇭", "🗳️", "🤝" ]
      }
    , { index = 11
      , isNew = True
      , content = "ក្នុងករណីដែលព្រះមហាក្សត្រ ពុំអាចបំពេញព្រះរាជភារៈ ជា ព្រះប្រមុខ\u{200B}រដ្ឋ\u{200B}បាន\u{200B}ដូច\u{200B}ធម្មតា ដោយព្រះអង្គទ្រង់ប្រឈួនជាទម្ងន់មានការ បញ្ជាក់ដោយ\u{200B}ក្រុមគ្រូពេទ្យជំនាញ ជ្រើសរើសដោយប្រធានព្រឹទ្ធសភា ប្រធានរដ្ឋសភា និងនាយករដ្ឋមន្ត្រី នោះប្រធានព្រឹទ្ធសភា បំពេញភារកិច្ច ប្រមុខរដ្ឋជំនួសព្រះអង្គក្នុងឋានៈជាព្រះរាជានុសិទ្ធិ។\n\nក្នុងករណីដែលប្រធានព្រឹទ្ធសភា ពុំមានលទ្ធភាពបំពេញភារកិច្ច ជាប្រមុខ\u{200B}រដ្ឋជំនួសព្រះមហាក្សត្រ ក្នុងឋានៈជាព្រះរាជានុសិទ្ធិ ពេលព្រះអង្គទ្រង់\u{200B}ប្រឈួន\u{200B}ជា\u{200B}ទម្ងន់ ដូចមានចែងក្នុងវាក្យខ័ណ្ឌខាងលើ ប្រធាន\u{200B}រដ្ឋ\u{200B}សភាជាអ្នកបំពេញភារកិច្ចនេះ។\n\nតំណែង\u{200B}ជាប្រមុខរដ្ឋជំនួសព្រះមហាក្សត្រក្នុងឋានៈជាព្រះរាជានុសិទ្ធិនេះ អាច\u{200B}នឹងដូរឥស្សរជនផ្សេងទៀត ក្នុងករណីដូចដែលបានចែង ក្នុងវាក្យខ័ណ្ឌ\u{200B}ខាងលើ តាមឋានានុក្រមដូចតទៅៈ\n\nក-អនុប្រធានទី ១ ព្រឹទ្ធសភា\n\nខ-អនុប្រធានទី ១ រដ្ឋសភា\n\nគ-អនុប្រធានទី ២ ព្រឹទ្ធសភា\n\nឃ-អនុប្រធានទី ២ រដ្ឋសភា"
      , referenceNumber = 1
      , chapterIndex = 2
      , tags = [ "🏛️" ]
      }
    , { index = 12
      , isNew = True
      , content = "នៅពេលព្រះមហាក្សត្រទ្រង់ចូលទីវង្គត ប្រធានព្រឹទ្ធសភាទទួល ភារកិច្ចជា\u{200B}ប្រមុខរដ្ឋស្តីទីក្នុងឋានៈជាព្រះរាជានុសិទ្ធិនៃព្រះរាជាណាចក្រកម្ពុជា។\n\nក្នុងករណីដែលប្រធានព្រឹទ្ធសភា ពុំមានលទ្ធភាពបំពេញភារកិច្ច ជាប្រមុខ\u{200B}រដ្ឋ\u{200B}ស្តីទីជំនួស\u{200B}ព្រះមហាក្សត្រ\u{200B}ក្នុងពេលព្រះអង្គចូលទីវង្គត ការទទួលភារកិច្ច\u{200B}\u{200B}ជា\u{200B}ប្រមុខរដ្ឋស្តីទីក្នុងឋានៈជាព្រះរាជានុសិទ្ធិ \u{200B}ត្រូវ\u{200B}អនុវត្តតាមវាក្យខ័ណ្ឌ\u{200B}ទី ២ និងទី ៣ នៃមាត្រា ១១ ថ្មី។"
      , referenceNumber = 2
      , chapterIndex = 2
      , tags = [ "👑", "🏛️", "⚖️" ]
      }
    , { index = 13
      , isNew = True
      , content = "ក្នុងរយៈវេលា ៧ថ្ងៃយ៉ាងយូរ ព្រះមហាក្សត្រថ្មី នៃព្រះរាជាណាចក្រកម្ពុជា ត្រូវបានជ្រើសរើស ដោយក្រុមប្រឹក្សារាជ្យសម្បត្តិ។\n\nសមាសភាពនៃក្រុមប្រឹក្សារាជ្យសម្បត្តិមានៈ\n\n    ប្រធានព្រឹទ្ធសភា\n    ប្រធានរដ្ឋសភា\n    នាយករដ្ឋមន្ត្រី\n    សម្តេចព្រះសង្ឃរាជ គណៈមហានិកាយ និងគណៈធម្មយុត្តិកនិកាយ\n    អនុប្រធានទី ១ និងអនុប្រធានទី ២ ព្រឹទ្ធសភា\n    អនុប្រធានទី ១ និងអនុប្រធានទី ២ រដ្ឋសភា\n\nការរៀបចំ និងការប្រព្រឹត្តទៅនៃក្រុមប្រឹក្សារាជ្យសម្បត្តិនឹងមាន កំណត់ក្នុងច្បាប់មួយ។"
      , referenceNumber = 3
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 14
      , isNew = False
      , content = "ត្រូវបានជ្រើសរើសជាព្រះមហាក្សត្រ នៃព្រះរាជាណាចក្រកម្ពុជា សមា\u{200B}ជិក\u{200B}នៃព្រះរាជវង្សានុវង្សខ្មែរ ដែលមានព្រះជន្មាយុយ៉ាងតិច ៣០ព្រះវស្សា ហើយដែលជាព្រះរាជបច្ឆាញាតិនៃព្រះមហាក្សត្រ អង្គឌួង ឬព្រះមហាក្សត្រ នរោត្តម ឬក៏ព្រះមហាក្សត្រ ស៊ីសុវត្ថិ។\n\nមុនចូលគ្រងរាជ្យសម្បត្តិ ព្រះមហាក្សត្រទ្រង់ថ្លែងសច្ចាប្រណិធាន ដូចមានចែងក្នុងឧបសម្ព័ន្ធទី ៤។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 15
      , isNew = False
      , content = "ព្រះជាយានៃព្រះមហាក្សត្រ មានព្រះរាជឋានៈជាព្រះមហេសី នៃព្រះរាជាណាចក្រកម្ពុជា។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑", "👸" ]
      }
    , { index = 16
      , isNew = False
      , content = "ព្រះមហេសីនៃព្រះរាជាណាចក្រកម្ពុជាពុំមានព្រះរាជសិទ្ធិ ធ្វើនយោបាយ ទទួលតួនាទីជាអ្នកដឹកនាំរដ្ឋ ឬជាអ្នកដឹកនាំរាជរដ្ឋាភិបាល ឬទទួលតួនាទីរដ្ឋបាល ឬនយោបាយឡើយ។\n\nព្រះមហេសីនៃព្រះរាជាណាចក្រកម្ពុជា ទុកព្រះរាជកាយពល បំពេញព្រះរាជភារៈបម្រើប្រយោជន៍សង្គម មនុស្សធម៌ សាសនា និងជួយព្រះមហាក្សត្រក្នុងព្រះរាជកាតព្វកិច្ចផ្នែកពិធីការ និងការទូត។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑", "👸" ]
      }
    , { index = 17
      , isNew = False
      , content = "ប្រការដែលព្រះមហាក្សត្រទ្រង់គ្រងរាជ្យសម្បត្តិ ប៉ុន្តែទ្រង់មិន កាន់អំណាច\u{200B}ឡើយ ហើយដែលមានចែងក្នុងវាក្យខ័ណ្ឌទី ១ នៃមាត្រា ៧ នៃរដ្ឋធម្មនុញ្ញនេះ មិនអាចសុំកែប្រែបានជាដាច់ខាត។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 18
      , isNew = True
      , content = "ព្រះមហាក្សត្រព្រះអង្គទ្រង់ទាក់ទងជាមួយព្រឹទ្ធសភា និងរដ្ឋសភា ដោយព្រះរាជសារ។\n\nព្រះរាជសារនេះ ព្រឹទ្ធសភា និងរដ្ឋសភាមិនអាចយកទៅជជែក ពិភាក្សាឡើយ។"
      , referenceNumber = 4
      , chapterIndex = 2
      , tags = [ "👑", "📩" ]
      }
    , { index = 19
      , isNew = True
      , content = "ព្រះមហាក្សត្រទ្រង់តែងតាំងនាយករដ្ឋមន្ត្រី និងទ្រង់តែងតាំងគណៈរដ្ឋមន្ត្រី តាមបែបបទដែលមានចែងក្នុងមាត្រា ១១៩ ថ្មី (ពីរ)។"
      , referenceNumber = 5
      , chapterIndex = 2
      , tags = [ "👑", "👔" ]
      }
    , { index = 20
      , isNew = False
      , content = "ព្រះមហាក្សត្រទ្រង់ទទួលសវនាការជាផ្លូវការពីរដងក្នុងមួយខែ ឱ្យនាយករដ្ឋមន្ត្រី និងគណៈរដ្ឋមន្ត្រីចូលគាល់រាយការណ៍ទូលថ្វាយ ទ្រង់ជ្រាបអំពីសភាព\u{200B}ការណ៍នៃប្រទេសជាតិ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 21
      , isNew = False
      , content = "តាមសេចក្តីស្នើរបស់គណៈរដ្ឋមន្ត្រី ព្រះមហាក្សត្រទ្រង់ឡាយ ព្រះហស្តលេខាលើព្រះរាជក្រឹត្យតែងតាំង ផ្លាស់ប្តូរ ឬបញ្ចប់ភារកិច្ចមន្ត្រី\u{200B}ជាន់ខ្ពស់ស៊ីវិល និងយោធា ឯកអគ្គរាជទូត និងប្រេសិតវិសាមញ្ញ និងពេញ សមត្ថភាព។\n\nតាមសេចក្តីស្នើរបស់ឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម ព្រះមហាក្សត្រទ្រង់ឡាយព្រះហស្តលេខាលើព្រះរាជក្រឹត្យតែងតាំង ផ្លាស់ប្តូរ ឬដក ចៅក្រមផ្នែកយុត្តាធិការ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 22
      , isNew = True
      , content = "នៅពេលប្រជាជាតិប្រឈមមុខនឹងគ្រោះថ្នាក់ ព្រះមហាក្សត្រ ទ្រង់ប្រកាស\u{200B}ប្រទានដំណឹងជាសាធារណៈ ដាក់ប្រទេសជាតិស្ថិតនៅក្នុង ភាពអាសន្ន ក្រោយពីបានមតិឯកភាពពីនាយករដ្ឋមន្ត្រី ប្រធានរដ្ឋសភា និងប្រធានព្រឹទ្ធសភា។"
      , referenceNumber = 6
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 23
      , isNew = False
      , content = "ព្រះមហាក្សត្រទ្រង់ជាមេបញ្ជាការកំពូលនៃកងយោធពលខេមរភូមិន្ទ។ អគ្គមេបញ្ជាការកងយោធពលខេមរភូមិន្ទ ត្រូវបានតែងតាំងឡើងដើម្បីបញ្ជាកងយោធពលខេមរភូមិន្ទនេះ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑", "\u{1FA96}" ]
      }
    , { index = 24
      , isNew = True
      , content = "ព្រះមហាក្សត្រទ្រង់គង់ជាព្រះអធិបតីនៃឧត្តមក្រុមប្រឹក្សាការពារជាតិ ដែលនឹងត្រូវបង្កើតឡើងដោយច្បាប់មួយ។\n\nព្រះមហាក្សត្រទ្រង់ប្រកាសសង្គ្រាម ក្រោយការអនុម័តរបស់ រដ្ឋសភា និងព្រឹទ្ធសភា។"
      , referenceNumber = 7
      , chapterIndex = 2
      , tags = [ "👑", "\u{1FA96}" ]
      }
    , { index = 25
      , isNew = False
      , content = "ព្រះមហាក្សត្រទ្រង់ទទួលសារតាំងឯកអគ្គរដ្ឋទូត ឬប្រេសិត វិសាមញ្ញ និងពេញសមត្ថភាពនៃប្រទេសក្រៅមកប្រចាំព្រះរាជាណាចក្រកម្ពុជា។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑", "🌏" ]
      }
    , { index = 26
      , isNew = True
      , content = "ព្រះមហាក្សត្រទ្រង់ឡាយព្រះហស្តលេខាលើសន្ធិសញ្ញា និងអនុសញ្ញាអន្តរជាតិ ហើយទ្រង់ប្រទានសច្ចាប័នលើសន្ធិសញ្ញា និងអនុសញ្ញា ទាំងនេះ ក្រោយបានទទួលការអនុម័តយល់ព្រមពីរដ្ឋសភា និងព្រឹទ្ធសភា។"
      , referenceNumber = 8
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 27
      , isNew = False
      , content = "ព្រះមហាក្សត្រទ្រង់មានព្រះរាជសិទ្ធិបន្ធូរបន្ថយទោសនិងលើក លែងទោស។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 28
      , isNew = True
      , content = "ព្រះមហាក្សត្រទ្រង់ឡាយព្រះហស្តលេខាលើព្រះរាជក្រម ប្រកាសឱ្យប្រើរដ្ឋធម្មនុញ្ញ ច្បាប់ដែលរដ្ឋសភាបានអនុម័ត និងព្រឹទ្ធសភា បានពិនិត្យចប់សព្វគ្រប់រួចហើយ និងទ្រង់ឡាយព្រះហស្តលេខាលើព្រះរាជក្រឹត្យតាមសេចក្តីស្នើសុំពីគណៈរដ្ឋមន្ត្រី។\n\nក្នុងពេលដែលព្រះមហាក្សត្រប្រឈួន ហើយត្រូវព្យាបាលព្រះរោគនៅបរទេស ក្នុងពេលនោះព្រះមហាក្សត្រមានសិទ្ធិផ្ទេរអំណាចឡាយ\u{200B}ព្រះហស្តលេខានៅលើព្រះរាជក្រម ឬព្រះរាជក្រឹត្យខាងលើនេះទៅប្រមុខរដ្ឋ ស្ដីទីចុះហត្ថលេខាជំនួសដោយព្រះរាជសារប្រគល់សិទ្ធិ។"
      , referenceNumber = 9
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 29
      , isNew = True
      , content = "ព្រះមហាក្សត្រទ្រង់បង្កើត និងប្រទានគ្រឿងឥស្សរិយយសជាតិ។\n\nព្រះមហាក្សត្រទ្រង់សម្រេចប្រទានឋានន្តរសក្តិ ឋានៈយោធា និង ស៊ីវិល តាមច្បាប់កំណត់។"
      , referenceNumber = 10
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 30
      , isNew = True
      , content = "ក្នុងរយៈពេលព្រះមហាក្សត្រទ្រង់អវត្តមាន ប្រធានព្រឹទ្ធសភាទទួល ភារកិច្ច\u{200B}ជាប្រមុខរដ្ឋស្តីទី។\n\nក្នុងករណីដែលប្រធានព្រឹទ្ធសភាពុំមានលទ្ធភាពបំពេញ ភារកិច្ចជាប្រមុខ\u{200B}រដ្ឋ\u{200B}ស្តីទីជំនួសព្រះមហាក្សត្រ ពេលព្រះអង្គទ្រង់អវត្ត\u{200B}មាន \u{200B}ការទទួលភារកិច្ច\u{200B}ជាប្រមុខរដ្ឋស្តីទី ត្រូវអនុវត្តតាមវាក្យខ័ណ្ឌទី២ និងទី៣ នៃមាត្រា១១ ថ្មី។\nជំពួកទី ៣៖ អំពីសិទ្ធិ និងករណីយកិច្ចរបស់ប្រជាពលរដ្ឋខ្មែរ"
      , referenceNumber = 11
      , chapterIndex = 2
      , tags = [ "👑" ]
      }
    , { index = 31
      , isNew = False
      , content = "ព្រះរាជាណាចក្រកម្ពុជាទទួលស្គាល់និងគោរពសិទ្ធិមនុស្សដូច មានចែងក្នុង\u{200B}ធម្មនុញ្ញអង្គការសហប្រជាជាតិ សេចក្តីប្រកាសជាសកលស្ដីពី សិទ្ធិមនុស្ស និងកតិកាសញ្ញា ព្រមទាំងអនុសញ្ញាទាំងឡាយទាក់ទងទៅនឹង\u{200B}សិទ្ធិ\u{200B}មនុស្ស សិទ្ធិនារី និងសិទ្ធិកុមារ។\n\nប្រជាពលរដ្ឋខ្មែរមានភាពស្មើគ្នាចំពោះមុខច្បាប់ មានសិទ្ធិសេរី ភាពនិងករណីយកិច្ចដូចគ្នាទាំងអស់ ដោយឥតប្រកាន់ពូជសាសន៍ ពណ៌សម្បុរ ភេទ ភាសា ជំនឿសាសនា និន្នាការនយោបាយ ដើមកំណើត ជាតិ ឋានៈ សង្គមធនធាន ឬស្ថានភាពឯទៀតឡើយ។ ការប្រើសិទ្ធិ សេរីភាពផ្ទាល់ខ្លួន\u{200B}របស់ បុគ្គលម្នាក់ៗមិនត្រូវឱ្យប៉ះពាល់ដល់សិទ្ធិសេរីភាពអ្នកដទៃឡើយ។ ការប្រើ សិទ្ធិសេរីភាពនេះ ត្រូវប្រព្រឹត្តតាមល័ក្ខខ័ណ្ឌកំណត់ក្នុងច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "🇰🇭", "👥" ]
      }
    , { index = 32
      , isNew = False
      , content = "ជនគ្រប់រូបមានសិទ្ធិរស់រានមានជីវិត មានសេរីភាព និងមានសន្តិសុខផ្ទាល់ខ្លួន។\n\nទោសប្រហារជីវិតមិនត្រូវឱ្យមានឡើយ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥" ]
      }
    , { index = 33
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរមិនអាចត្រូវបានដកសញ្ជាតិ និរទេស ឬចាប់ បញ្ជូនខ្លួនទៅឱ្យប្រទេសក្រៅណាមួយឡើយ លើកលែងតែមានកិច្ចព្រមព្រៀងជា\u{200B}មួយ\u{200B}គ្នាទៅវិញទៅមក។\n\nប្រជាពលរដ្ឋខ្មែរដែលកំពុងរស់នៅឯបរទេសត្រូវបាន រដ្ឋគាំពារ។\n\nការទទួលសញ្ជាតិខ្មែរត្រូវកំណត់ក្នុងច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "🇰🇭", "👥" ]
      }
    , { index = 34
      , isNew = True
      , content = "ប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ មានសិទ្ធិបោះឆ្នោត និងអាចឈរ ឈ្មោះឱ្យគេបោះឆ្នោត។\n\nប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ ដែលមានអាយុយ៉ាងតិច ១៨ឆ្នាំ មានសិទ្ធិបោះឆ្នោត។\n\nប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ ដែលមានអាយុយ៉ាងតិច ២៥ឆ្នាំ អាចឈរឈ្មោះ\u{200B}ឱ្យគេបោះឆ្នោតជ្រើសតាំងតំណាងរាស្ត្រ។\n\nប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ ដែលមានអាយុយ៉ាងតិច ៤០ឆ្នាំ អាចឈរឈ្មោះឱ្យគេបោះឆ្នោតជ្រើសតាំងជាសមាជិកព្រឹទ្ធសភា។\n\nបទប្បញ្ញត្តិបន្ថយសិទ្ធិបោះឆ្នោត និងសិទ្ធិឈរឈ្មោះឱ្យគេបោះឆ្នោត ត្រូវចែង\u{200B}ក្នុង\u{200B}ច្បាប់បោះឆ្នោត។"
      , referenceNumber = 12
      , chapterIndex = 2
      , tags = [ "👥", "🚹", "🚺" ]
      }
    , { index = 35
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ មានសិទ្ធិចូលរួមយ៉ាងសកម្មក្នុង\u{200B}ជីវភាពនយោបាយ សេដ្ឋកិច្ច សង្គមកិច្ច និងវប្បធម៌របស់ប្រទេសជាតិ។\n\nសេចក្តីស្នើទាំងឡាយរបស់ប្រជាពលរដ្ឋ ត្រូវបានទទួលការពិនិត្យ និងដោះ\u{200B}ស្រាយយ៉ាង\u{200B}ហ្មត់ចត់ពីអង្គការរដ្ឋ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥" ]
      }
    , { index = 36
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ មានសិទ្ធិជ្រើសរើសមុខរបរសម\u{200B}ស្របតាមសមត្ថ\u{200B}ភាព\u{200B}របស់ខ្លួន តាមសេចក្តីត្រូវការរបស់សង្គម។\n\nប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ មានសិទ្ធិទទួលប្រាក់បំណាច់ស្មើគ្នា ចំពោះការងារដូចគ្នា។\n\nការងារមេផ្ទះមានតម្លៃស្មើគ្នានឹងកម្រៃដែលបានមកពីការងារធ្វើនៅក្រៅផ្ទះ។\n\nប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ មានសិទ្ធិទទួលការធានារ៉ាប់រងសង្គម និងអត្ថប្រយោជន៍ខាងសង្គមកិច្ច ដែលមានចែងក្នុងច្បាប់។\n\nប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ មានសិទ្ធិបង្កើតសហជីព និងចូលជាសមាជិកសហជីពនេះ។\n\nការរៀបចំ និងការប្រព្រឹត្តទៅនៃសហជីព នឹងមានកំណត់ក្នុងច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥" ]
      }
    , { index = 37
      , isNew = False
      , content = "សិទ្ធិធ្វើកូដកម្ម និងធ្វើបាតុកម្មដោយសន្តិវិធី ត្រូវយកមកអនុវត្ត នៅក្នុងក្របខ័ណ្ឌនៃច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "📢" ]
      }
    , { index = 38
      , isNew = False
      , content = "ច្បាប់រ៉ាប់រងមិនឱ្យមានការរំលោភបំពានលើរូបរាងកាយបុគ្គល ណាមួយឡើយ។ ច្បាប់ការពារជីវិត កិត្តិយស និងសេចក្តីថ្លៃថ្នូររបស់ប្រជាពលរដ្ឋ។\n\nការចោទប្រកាន់ ការចាប់ខ្លួន ការឃាត់ខ្លួន ឬការឃុំខ្លួនជនណាមួយនឹងអាច\u{200B}ធ្វើទៅកើត លុះត្រាតែអនុវត្តត្រឹមត្រូវតាមបញ្ញត្តិច្បាប់។\n\nការបង្ខិតបង្ខំ ការធ្វើបាបលើរូបរាងកាយ ឬប្រព្រឹត្តិកម្មណា មួយដែលបន្ថែម\u{200B}ទម្ងន់ទណ្ឌកម្ម អនុវត្តចំពោះជនជាប់ឃុំឃាំង ឬជាប់ពន្ធនាគារ ត្រូវហាម\u{200B}ឃាត់\u{200B}មិនឱ្យធ្វើឡើយ។ អ្នកដៃដល់ អ្នករួមប្រព្រឹត្ត និងអ្នកសមគំនិត ត្រូវទទួលទោសតាមច្បាប់។\n\nការទទួលសារភាពដែលកើតឡើងពីការបង្ខិតបង្ខំតាមផ្លូវកាយក្តី តាមផ្លូវចិត្តក្តី មិនត្រូវទុកជាភស្តុតាងនៃពិរុទ្ធភាពទេ។\n\nវិមតិសង្ស័យ ត្រូវបានជាប្រយោជន៍ដល់ជនជាប់ចោទ។\n\nជនជាប់ចោទណាក៏ដោយ ត្រូវទុកជាមនុស្សឥតទោស ដរាបណា\u{200B}តុលាការមិនទាន់កាត់ទោសជាស្ថាពរ។\n\nជនគ្រប់រូប មានសិទ្ធិការពារខ្លួនតាមផ្លូវតុលាការ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "⛓️" ]
      }
    , { index = 39
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរមានសិទ្ធិប្តឹងបរិហារ ប្តឹងតវ៉ា ឬប្តឹងទារសំណង ជួសជុលការខូចខាតដែលបណ្តាលមកពីអំពើខុសច្បាប់របស់អង្គការរដ្ឋ របស់អង្គការ\u{200B}សង្គម និងរបស់បុគ្គលិកនៃអង្គការទាំងនោះ។ ការដោះស្រាយបណ្តឹង តវ៉ា និងសំណងជួសជុលការខូចខាតជាសមត្ថកិច្ចរបស់តុលាការ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "📜" ]
      }
    , { index = 40
      , isNew = False
      , content = "សេរីភាពក្នុងការដើរឆ្ងាយជិត និងតាំងទីលំនៅក្នុងស្ថានភាពស្របច្បាប់របស់ប្រជាពលរដ្ឋ ត្រូវបានគោរព។\n\nប្រជាពលរដ្ឋខ្មែរអាចចេញទៅតាំងទីលំនៅ នៅប្រទេសក្រៅ ឬវិលត្រឡប់មកវិញបាន។\n\nការរក្សាសិទ្ធិមិនឱ្យរំលោភលើលំនៅឋាន និងអាថ៌កំបាំងនៃការឆ្លើយឆ្លងតាមលិខិត តាមសារទូរលេខ ទូរពុម្ព ទូរគមន៍ និងតាមទូរស័ព្ទ ត្រូវបានធានា។\n\nការឆែកឆេរលំនៅឋាន សម្ភារៈវត្ថុ និងលើរូបបុគ្គល ត្រូវធ្វើឱ្យស្របនឹងបញ្ញត្តិច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "🕊️", "🗣️", "🏡", "🌏" ]
      }
    , { index = 41
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរមានសេរីភាពខាងការបញ្ចេញមតិរបស់ខ្លួន សេរីភាពខាងសារព័ត៌មាន សេរីភាពខាងការបោះពុម្ពផ្សាយ សេរីភាពខាង ការប្រជុំ។ ជនណាក៏ដោយ មិនអាចឆ្លៀតប្រើសិទ្ធិនេះ ដោយរំលោភ នាំឱ្យប៉ះពាល់ដល់កិត្តិយសរបស់អ្នកដទៃ ដល់ទំនៀមទម្លាប់ល្អរបស់សង្គម ដល់សណ្តាប់ធ្នាប់សាធារណៈ និងដល់សន្តិសុខជាតិបានឡើយ។\n\nរបបសារព័ត៌មាន ត្រូវរៀបចំឡើងដោយច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "🕊️", "🗣️" ]
      }
    , { index = 42
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរមានសិទ្ធិបង្កើតសមាគមនិងគណបក្សនយោបាយ។ សិទ្ធិនេះត្រូវកំណត់ក្នុងច្បាប់។\n\nប្រជាពលរដ្ឋខ្មែរទាំងឡាយ អាចចូលរួមក្នុងអង្គការមហាជន ជួយគ្នាទៅវិញ\u{200B}ទៅមក ការពារសមិទ្ធផលជាតិ និងសណ្តាប់ធ្នាប់សង្គម។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "🕊️" ]
      }
    , { index = 43
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ មានសិទ្ធិពេញទីខាងជំនឿ។\n\nសេរីភាពខាងជំនឿ និងការប្រតិបត្តិខាងផ្លូវសាសនា ត្រូវបាន រដ្ឋធានាក្នុង\u{200B}ល័ក្ខខ័ណ្ឌ ដែលមិនប៉ះពាល់ដល់ជំនឿ ឬសាសនាដទៃទៀត ដល់\u{200B}សណ្តាប់\u{200B}ធ្នាប់ និងសន្តិសុខសាធារណៈ។\n\nព្រះពុទ្ធសាសនាជាសាសនារបស់រដ្ឋ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "☸️" ]
      }
    , { index = 44
      , isNew = False
      , content = "ជនណាក៏ដោយ ទោះជាបុគ្គលក្តី ជាសមូហភាពក្តី មានសិទ្ធិ ជាម្ចាស់កម្មសិទ្ធិ។ មានតែរូបវន្តបុគ្គល ឬនីតិបុគ្គលដែលមានសញ្ជាតិជាខ្មែរទេ ទើបមានសិទ្ធិជាម្ចាស់កម្មសិទ្ធិលើដីធ្លី។\n\nកម្មសិទ្ធិឯកជនស្របច្បាប់ស្ថិតនៅក្រោមការគាំពារនៃច្បាប់។\n\nដែលនឹងដកហូតកម្មសិទ្ធិអំពីជនណាមួយបាននោះ លុះត្រាតែ ប្រយោជន៍\u{200B}សាធារណៈតម្រូវឱ្យធ្វើក្នុងករណីដែលច្បាប់បានបញ្ញត្តិទុក ហើយត្រូវផ្តល់សំណងជាមុន ដោយសមរម្យ និងយុត្តិធម៌។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "🏢", "🔑" ]
      }
    , { index = 45
      , isNew = False
      , content = "ការរើសអើងគ្រប់ប្រភេទ ប្រឆាំងនឹងស្ត្រីភេទ ត្រូវបំបាត់ចោល។ ការធ្វើអាជីវកម្មលើការងាររបស់ស្ត្រី ត្រូវហាមឃាត់។\n\nបុរសនិងស្រ្តីមានសិទ្ធិស្មើគ្នាក្នុងគ្រប់វិស័យទាំងអស់ ជាពិសេសក្នុងអាពាហ៍\u{200B}ពិពាហ៍ និងគ្រួសារ។\n\nអាពាហ៍ពិពាហ៍ ត្រូវធ្វើតាមល័ក្ខខ័ណ្ឌដែលមានចែងក្នុងច្បាប់ និងតាមគោលការណ៍ស្ម័គ្រចិត្ត ប្តីមួយប្រពន្ធមួយ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "🚺" ]
      }
    , { index = 46
      , isNew = False
      , content = "អំពើលក់ដូរមនុស្ស អំពើធ្វើអាជីវកម្មផ្នែកពេស្យាកម្ម និងអំពើ អាស-\u{200B}អាភាស ដែលប៉ះពាល់ដល់សេចក្តីថ្លៃថ្នូររបស់នារី ត្រូវហាមឃាត់។\n\nត្រូវហាមឃាត់មិនឱ្យមានការបញ្ឈប់នារីពីការងារ ដោយមូលហេតុមានគភ៌។ នារីមានសិទ្ធិឈប់សម្រាកនៅពេលសម្រាលកូនដោយទទួល ប្រាក់បៀវត្ស និងដោយមានការធានារក្សាសិទ្ធិអតីតភាពក្នុងការងារ និង អត្ថប្រយោជន៍សង្គមផ្សេងៗទៀត។\n\nរដ្ឋ និងសង្គមយកចិត្តទុកដាក់បង្កលក្ខណៈឱ្យនារី ជាពិសេសនារី នៅជនបទដែលគ្មានទីពឹង បានទទួលការឧបត្ថម្ភ ដើម្បីមានមុខរបរ មានលទ្ធភាពព្យាបាលជំងឺ ឱ្យកូនទៅរៀន និងមានជីវភាពរស់នៅសមរម្យ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "🚺", "🚔" ]
      }
    , { index = 47
      , isNew = False
      , content = "មាតាបិតាមានកាតព្វកិច្ចចិញ្ចឹមថែរក្សា និងអប់រំកូនឱ្យទៅជា ពលរដ្ឋល្អ។\n\nកូនមានករណីយកិច្ចចិញ្ចឹមនិងបីបាច់ថែរក្សាមាតាបិតា ដែលចាស់ជរា តាមទំនៀមទម្លាប់ខ្មែរ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥" ]
      }
    , { index = 48
      , isNew = False
      , content = "រដ្ឋធានារក្សាការពារសិទ្ធិរបស់កុមារ ដែលមានចែងក្នុងអនុសញ្ញាស្តីពីកុមារ ជាពិសេសសិទ្ធិមានជីវិតរស់នៅ សិទ្ធិទទួលការអប់រំរៀនសូត្រ សិទ្ធិត្រូវបានទទួលការគាំពារ ក្នុងស្ថានការណ៍មានសង្គ្រាម និងការការពារប្រឆាំងនឹងអាជីវកម្ម សេដ្ឋកិច្ច ឬកាមគុណលើកុមារ។\n\nរដ្ឋគាំពារប្រឆាំងនឹងការងារទាំងឡាយ ដែលអាចធ្វើឱ្យខូចដល់ ការអប់រំ និងការរៀនសូត្ររបស់កុមារ ឬដែលនាំឱ្យអន្តរាយដល់សុខភាព ឬសុខុ-\u{200B}មាល\u{200B}ភាពរបស់កុមារ។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "🏛️", "👥", "🚼" ]
      }
    , { index = 49
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរគ្រប់រូបត្រូវគោរពរដ្ឋធម្មនុញ្ញ និងគោរពច្បាប់។\n\nប្រជាពលរដ្ឋខ្មែរគ្រប់រូបមានកាតព្វកិច្ចរួមចំណែកកសាងប្រទេសជាតិ និងការពារមាតុភូមិ។\n\nកាតព្វកិច្ចការពារមាតុភូមិត្រូវអនុវត្តតាមបញ្ញត្តិច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥", "\u{1FA96}", "💵" ]
      }
    , { index = 50
      , isNew = False
      , content = "ប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទត្រូវគោរពគោលការណ៍អធិបតេយ្យជាតិ និងលទ្ធិប្រជាធិបតេយ្យសេរីពហុបក្ស។\n\nប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទត្រូវគោរពទ្រព្យសម្បត្តិសាធារណៈ និងកម្មសិទ្ធិ\u{200B}ស្របច្បាប់របស់ឯកជន។"
      , referenceNumber = 0
      , chapterIndex = 2
      , tags = [ "👥" ]
      }
    , { index = 51
      , isNew = True
      , content = "ព្រះរាជាណាចក្រកម្ពុជា អនុវត្តនយោបាយប្រជាធិបតេយ្យ សេរី ពហុបក្ស។\n\nប្រជាពលរដ្ឋខ្មែរជាម្ចាស់វាសនានៃប្រទេសជាតិរបស់ខ្លួន។ អំណាចទាំងអស់ជារបស់ប្រជាពលរដ្ឋ។\n\nប្រជាពលរដ្ឋប្រើអំណាចរបស់ខ្លួន តាមរយៈរដ្ឋសភា ព្រឹទ្ធសភា រាជរដ្ឋា-ភិបាល និងសាលាជម្រះក្តី។\n\nអំណាចបែងចែកដាច់ពីគ្នា រវាងអំណាចនីតិប្បញ្ញត្តិ អំណាច នីតិប្រតិបត្តិ និងអំណាចតុលាការ។"
      , referenceNumber = 13
      , chapterIndex = 4
      , tags = [ "👥", "🗳️" ]
      }
    , { index = 52
      , isNew = False
      , content = "រាជរដ្ឋាភិបាលកម្ពុជា ប្តេជ្ញារក្សាការពារឯករាជ្យ អធិបតេយ្យ បូរណភាពទឹកដីនៃព្រះរាជាណាចក្រកម្ពុជា អនុវត្តនយោបាយបង្រួបបង្រួមជាតិ ដើម្បី\u{200B}ការពារ\u{200B}ឯកភាព\u{200B}ជាតិ រក្សាការពារទំនៀមទម្លាប់ និងប្រពៃណីល្អ របស់ជាតិ។ រាជរដ្ឋាភិបាលកម្ពុជា ត្រូវការពារនីត្យានុកូលភាព ធានាសណ្តាប់ធ្នាប់ និងសន្តិសុខសាធារណៈ។ រដ្ឋយកចិត្តទុកដាក់ជាអាទិភាព ចំពោះ ជីវភាពរស់នៅ និងសុខុមាលភាពរបស់ប្រជាពលរដ្ឋ។"
      , referenceNumber = 0
      , chapterIndex = 4
      , tags = [ "👔", "🏛️", "\u{1FA96}" ]
      }
    , { index = 53
      , isNew = False
      , content = "ព្រះរាជាណាចក្រកម្ពុជា ប្រកាន់ខ្ជាប់ជានិច្ចនូវ នយោបាយអព្យាក្រឹត\u{200B}\u{200B}\u{200B}\u{200B}\u{200B}អចិន្ត្រៃយ៍ និងមិនចូលបក្សសម្ព័ន្ធ។ ព្រះរាជាណាចក្រកម្ពុជា រួមរស់ដោយ\u{200B}សន្តិសហវិជ្ជមានជាមួយប្រទេសជិតខាង និងប្រទេសដទៃទៀត ទាំងអស់នៅលើសកលលោក។\n\nព្រះរាជាណាចក្រកម្ពុជាមិនឈ្លានពានប្រទេសណាដាច់ខាត មិនជ្រៀតជ្រែកកិច្ចការផ្ទៃក្នុងនៃប្រទេសដទៃដោយផ្ទាល់ ឬដោយប្រយោល ទោះបីក្រោមរូបភាពណាក៏ដោយ ដោះស្រាយរាល់បញ្ហាដោយសន្តិវិធី និង គោរព\u{200B}ផលប្រយោជន៍ផងគ្នាទៅវិញទៅមក។\n\nព្រះរាជាណាចក្រកម្ពុជាមិនចងសម្ព័ន្ធយោធា ឬចូលក្នុងកិច្ចព្រមព្រៀងយោធាណាមួយ ដែលមិនស្របនឹងអព្យាក្រឹតភាពរបស់ខ្លួនឡើយ។\n\nព្រះរាជាណាចក្រកម្ពុជាមិនអនុញ្ញាតឱ្យមានមូលដ្ឋានយោធាបរទេសនៅលើទឹកដីរបស់ខ្លួន ហើយក៏មិនអនុញ្ញាតឱ្យមានមូលដ្ឋានយោធា របស់ខ្លួន\u{200B}នៅបរទេសដែរ លើកលែងតែក្នុងក្របខ័ណ្ឌ នៃសំណូមពររបស់ អង្គការសហប្រជាជាតិ។\n\nព្រះរាជាណាចក្រកម្ពុជារក្សាសិទ្ធិទទួលយកជំនួយបរទេស ជាសម្ភារយោធា អាវុធ គ្រាប់រំសេវ ការហ្វឹកហ្វឺនកងកម្លាំងប្រដាប់អាវុធ និងជំនួយផ្សេងៗទៀត ដើម្បីការពារខ្លួននិងធានាសណ្តាប់ធ្នាប់ និងសន្តិសុខ សាធារណៈនៅផ្ទៃក្នុងប្រទេស។"
      , referenceNumber = 0
      , chapterIndex = 4
      , tags = [ "🇰🇭", "🌏", "🕊️" ]
      }
    , { index = 54
      , isNew = False
      , content = "ការផលិត ការប្រើប្រាស់ ការរក្សាទុកអាវុធបរមាណូ អាវុធគីមី ឬអាវុធវេ-ត្រាណូ ត្រូវហាមឃាត់ដាច់ខាត។"
      , referenceNumber = 0
      , chapterIndex = 4
      , tags = [ "☢️", "🚔" ]
      }
    , { index = 55
      , isNew = False
      , content = "សន្ធិសញ្ញានិងកិច្ចព្រមព្រៀងទាំងឡាយណា ដែលមិនស្របនឹងឯករាជ្យ អធិបតេយ្យ បូរណភាពទឹកដី អព្យាក្រឹតភាព និងឯកភាពជាតិ របស់ព្រះរាជាណាចក្រកម្ពុជា ត្រូវលុបចោល។"
      , referenceNumber = 0
      , chapterIndex = 4
      , tags = [ "🇰🇭", "🕊️" ]
      }
    , { index = 56
      , isNew = False
      , content = "ព្រះរាជាណាចក្រកម្ពុជា អនុវត្តប្រព័ន្ធសេដ្ឋកិច្ចទីផ្សារ។\n\nការរៀបចំ និងការប្រព្រឹត្តទៅនៃប្រព័ន្ធសេដ្ឋកិច្ចនេះនឹងមាន កំណត់ក្នុងច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 57
      , isNew = False
      , content = "ការយកពន្ធដារនឹងអាចធ្វើទៅបាន លុះត្រាតែមានច្បាប់អនុញ្ញាត។ ថវិកាជាតិ ត្រូវបានកំណត់ឱ្យអនុវត្តតាមច្បាប់។\n\nរបបគ្រប់គ្រងរូបិយវត្ថុ និងប្រព័ន្ធហិរញ្ញវត្ថុ ត្រូវកំណត់ក្នុងច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 58
      , isNew = False
      , content = "ទ្រព្យសម្បត្តិរបស់រដ្ឋមានជាអាទិ៍ ដីធ្លី ក្រោមដី ភ្នំ សមុទ្រ បាតសមុទ្រ ក្រោមបាតសមុទ្រ ឆ្នេរសមុទ្រ អាកាស កោះ ទន្លេ ព្រែក ស្ទឹង បឹង ព្រៃឈើ ធនធានធម្មជាតិ មជ្ឈមណ្ឌលសេដ្ឋកិច្ចវប្បធម៌ មូលដ្ឋានការពារប្រទេស សំណង់ផ្សេងៗទៀត ដែលបានកំណត់ថាជារបស់រដ្ឋ។\n\nការគ្រប់គ្រង ការប្រើប្រាស់និងការចាត់ចែងលើទ្រព្យសម្បត្តិរដ្ឋ នឹងត្រូវកំណត់ក្នុងច្បាប់។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 59
      , isNew = False
      , content = "រដ្ឋត្រូវរក្សាការពារបរិស្ថាន និងតុល្យភាព នៃភោគទ្រព្យធម្មជាតិ ហើយត្រូវចាត់ចែងឱ្យមានផែនការច្បាស់លាស់ក្នុងការគ្រប់គ្រងមានជាអាទិ៍ ដីធ្លី ទឹក អាកាស ខ្យល់ ភូគព្ភសាស្ត្រ ប្រព័ន្ធអេកូឡូស៊ី រ៉ែ ថាមពល ប្រេងកាត និងឧស្ម័ន ថ្ម និងខ្សាច់ ត្បូងថ្ម ព្រៃឈើ និងអនុផលព្រៃឈើ ពពួក សត្វព្រៃ មច្ឆាជាតិ ធនធានជលផល។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 60
      , isNew = False
      , content = "ពលរដ្ឋមានសិទ្ធិលក់ដូរផលិតផលរបស់ខ្លួនដោយសេរី។ ការតម្រូវឱ្យលក់ផលិតផលជូនរដ្ឋ ឬការយកភោគផល ឬទ្រព្យសម្បត្តិ ឯកជនទៅ ប្រើប្រាស់ ទោះបីមួយរយៈពេលក៏ដោយត្រូវហាមឃាត់ វៀរលែងតែក្នុងករណីពិសេស ដែលមានច្បាប់អនុញ្ញាត។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 61
      , isNew = False
      , content = "រដ្ឋជំរុញការអភិវឌ្ឍសេដ្ឋកិច្ចគ្រប់វិស័យជាពិសេសវិស័យកសិកម្ម សិប្បកម្ម ឧស្សាហកម្ម ចាប់ពីតំបន់ដាច់ស្រយាលដោយយកចិត្តទុកដាក់ ទៅលើនយោបាយទឹក ភ្លើង ផ្លូវ និងមធ្យោបាយដឹកជញ្ជូន បច្ចេកទេស ទំនើប និងប្រព័ន្ធឥណទាន។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 62
      , isNew = False
      , content = "រដ្ឋយកចិត្តទុកដាក់ជួយដោះស្រាយមធ្យោបាយផលិត ការពារថ្លៃផលិតផលជូនកសិករ សិប្បករ និងជួយរកទីផ្សារលក់ផលិតផល។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 63
      , isNew = False
      , content = "រដ្ឋយកចិត្តទុកដាក់គ្រប់គ្រងទីផ្សារ ជួយឱ្យជីវភាពរស់នៅរបស់ ប្រជាពលរដ្ឋមានកម្រិតសមរម្យ។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 64
      , isNew = False
      , content = "រដ្ឋហាមឃាត់ និងផ្តន្ទាទោសជាទម្ងន់ ដល់ជនណាដែលនាំចូល ផលិត លក់ដូរគ្រឿងញៀន ទំនិញក្លែងក្លាយ ហួសរយៈពេលប្រើ ដែលប៉ះពាល់ ដល់សុខភាពអាយុជីវិតរបស់អ្នកប្រើ។"
      , referenceNumber = 0
      , chapterIndex = 5
      , tags = [ "🚧" ]
      }
    , { index = 65
      , isNew = False
      , content = "រដ្ឋត្រូវការពារ និងលើកស្ទួយសិទ្ធិរបស់ប្រជាពលរដ្ឋ ក្នុងការទទួល ការអប់រំ\u{200B}ប្រកបដោយគុណភាពនៅគ្រប់កម្រិត និងត្រូវចាត់វិធានការគ្រប់បែប\u{200B}\u{200B}យ៉ាង\u{200B}ជាជំហានៗ ដើម្បីឱ្យការអប់រំនេះបានទៅដល់ប្រជាពលរដ្ឋគ្រប់រូប។\n\nរដ្ឋយកចិត្តទុកដាក់ដល់វិស័យអប់រំកាយនិងកីឡាដែលជាសុខុមាលភាពរបស់ប្រជាពលរដ្ឋខ្មែរគ្រប់រូប។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 66
      , isNew = False
      , content = "រដ្ឋកសាងប្រព័ន្ធអប់រំមួយពេញលេញនិងឯកភាពនៅទូទាំង ប្រទេស ដែល\u{200B}\u{200B}ធានាឱ្យបាននូវគោលការណ៍សេរីភាពខាងសិក្សាធិការ និងគោលការណ៍សមភាពក្នុងការអប់រំ ដើម្បីឱ្យប្រជាពលរដ្ឋគ្រប់រូបមានភ័ព្វសំណាងគ្រប់គ្រាន់ស្មើគ្នាក្នុងការកសាងជីវិត។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 67
      , isNew = False
      , content = "រដ្ឋអនុវត្តកម្មវិធីសិក្សានិងគោលការណ៍គរុកោសល្យទំនើប រាប់បញ្ចូលទាំង\u{200B}បច្ចេកវិទ្យា និងភាសាបរទេស។\n\nរដ្ឋគ្រប់គ្រងគ្រឹះស្ថានសិក្សានិងថ្នាក់សិក្សាសាធារណៈ និងឯកជន នៅគ្រប់\u{200B}\u{200B}ភូមិសិក្សា។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 68
      , isNew = False
      , content = "រដ្ឋផ្តល់កិច្ចការអប់រំផ្នែកបឋម និងមធ្យមសិក្សា នៅសាលារៀនសាធារណៈ សម្រាប់ប្រជាពលរដ្ឋគ្រប់រូបដោយឥតបង់ថ្ងៃ។\n\nប្រជាពលរដ្ឋ ត្រូវបានទទួលការអប់រំយ៉ាងតិចប្រាំបួនឆ្នាំ។\n\nរដ្ឋជួយផ្សព្វផ្សាយ និងលើកតម្កើងសាលាបាលី និងពុទ្ធិកសិក្សា។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 69
      , isNew = False
      , content = "រដ្ឋមានកាតព្វកិច្ចថែរក្សា និងពង្រីកវប្បធម៌ជាតិ។\n\nរដ្ឋមានកាតព្វកិច្ចការពារ និងពង្រីកភាសាខ្មែរឱ្យសមស្របនឹង សេចក្តីត្រូវការ។\n\nរដ្ឋមានកាតព្វកិច្ចថែរក្សា និងការពារប្រាសាទបុរាណ វត្ថុសិល្បៈបុរាណ និង\u{200B}កែលំអរមណីយដ្ឋានប្រវត្តិសាស្ត្រឡើងវិញ។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 70
      , isNew = False
      , content = "បទល្មើសទាំងឡាយដែលប៉ះពាល់ ឬទាក់ទងនឹងបេតិកភណ្ឌវប្បធម៌ និងបេតិកភណ្ឌសិល្បៈ ត្រូវផ្តន្ទាទោសជាទម្ងន់។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 71
      , isNew = False
      , content = "បរិវេណបេតិកភណ្ឌជាតិ ក៏ដូចជាបេតិកភណ្ឌ ដែលបានបញ្ចូលជាបេតិ\u{200B}-កភណ្ឌពិភពលោក ត្រូវទុកជាតំបន់អព្យាក្រឹត ដែលមិនឱ្យមានសកម្ម\u{200B}ភាពយោធា។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 72
      , isNew = False
      , content = "សុខភាពរបស់ប្រជារាស្ត្រត្រូវបានធានា។ រដ្ឋយកចិត្តទុកដាក់ ដល់ការការពារជំងឺ និងព្យាបាលជំងឺ។ ប្រជារាស្ត្រក្រីក្រត្រូវបានទទួលពិនិត្យរោគដោយឥតបង់ថ្លៃនៅតាមមន្ទីរពេទ្យ គិលានដ្ឋាន និងមន្ទីរសម្ភពសាធារណៈ។\n\nរដ្ឋរៀបចំឱ្យមានគិលានដ្ឋាន និងមន្ទីរសម្ភពដល់ជនបទ។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 73
      , isNew = False
      , content = "រដ្ឋយកចិត្តទុកដាក់ចំពោះកុមារ និងមាតា។ រដ្ឋរៀបចំឱ្យមាន ទារកដ្ឋាន និងជួយឧបត្ថម្ភនារីដែលមានកូនច្រើនក្នុងបន្ទុក ហើយឥតទីពឹង។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 74
      , isNew = False
      , content = "រដ្ឋជួយឧបត្ថម្ភជនពិការ និងដល់គ្រួសារយុទ្ធជនដែលបានបូជាជីវិតដើម្បី\u{200B}ប្រទេសជាតិ។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 75
      , isNew = False
      , content = "រដ្ឋចាត់ចែងឱ្យមានរបបសន្តិសុខសង្គមដល់កម្មករ និងនិយោជិត។"
      , referenceNumber = 0
      , chapterIndex = 6
      , tags = [ "🚧" ]
      }
    , { index = 76
      , isNew = True
      , content = "រដ្ឋសភាមានសមាជិកតំណាងរាស្ត្រយ៉ាងតិច ១២០ រូប។\n\nតំណាងរាស្ត្រត្រូវជ្រើសតាំងដោយការបោះឆ្នោតជាសកល ដោយសេរី ដោយស្មើភាព ដោយចំពោះ និងតាមវិធីជ្រើសរើសឆ្នោតជាសម្ងាត់។\n\nតំណាងរាស្ត្រអាចឈរឈ្មោះបោះឆ្នោតសាជាថ្មីបាន។\n\nអ្នកដែលមានសិទ្ធិឈរឈ្មោះជាបេក្ខជនតំណាងរាស្ត្រ គឺជាប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ ដែលមានសិទ្ធិបោះឆ្នោត មានអាយុយ៉ាងតិច ២៥ឆ្នាំ មាន\u{200B}សញ្ជាតិជាខ្មែរតាំងពីកំណើត។\n\nបែបបទ និងការប្រព្រឹត្តទៅនៃការបោះឆ្នោត ត្រូវកំណត់ក្នុងច្បាប់បោះឆ្នោត។"
      , referenceNumber = 14
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 77
      , isNew = False
      , content = "តំណាងរាស្ត្រក្នុងរដ្ឋសភា ជាតំណាងប្រជាជាតិខ្មែរទាំងមូល ពុំមែនគ្រាន់តែ\u{200B}ជាតំណាងប្រជាពលរដ្ឋក្នុងមណ្ឌលរបស់ខ្លួននោះទេ។\n\nអាណត្តិអាជ្ញាបញ្ជាទាំងឡាយ ត្រូវទុកជាមោឃៈ។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 78
      , isNew = False
      , content = "នីតិកាលរបស់រដ្ឋសភាមានកំណត់ ៥ឆ្នាំ ហើយត្រូវផុតកំណត់ នៅពេលដែលរដ្ឋសភាថ្មីចូលកាន់តំណែង។ រដ្ឋសភាមិនអាចត្រូវបានរំលាយ មុនផុតអាណត្តិបានឡើយ វៀរលែងតែក្នុងករណីដែលរាជរដ្ឋាភិបាលត្រូវ បានទម្លាក់ពីរដងក្នុងរយៈពេល ១២ខែ។\n\nក្នុងករណីនេះ ព្រះមហាក្សត្រត្រូវរំលាយរដ្ឋសភា ក្រោយពីព្រះអង្គទ្រង់បានទទួលការស្នើពីនាយករដ្ឋមន្ត្រី និងបន្ទាប់ពីទ្រង់បានការ យល់ព្រមពីប្រធានរដ្ឋសភា។\n\nការបោះឆ្នោតដើម្បីជ្រើសរើសរដ្ឋសភាថ្មី នឹងប្រព្រឹត្តទៅក្នុង រយៈពេល ៦០ ថ្ងៃ យ៉ាងយូរ ចាប់តាំងពីថ្ងៃរំលាយរដ្ឋសភាមក។\n\nក្នុងរយៈកាលនេះ រាជរដ្ឋាភិបាលមានតែភារកិច្ចដឹកនាំការងារ ប្រចាំថ្ងៃតែប៉ុណ្ណោះ។\n\nក្នុងពេលមានសង្គ្រាម ឬក្នុងកាលៈទេសៈពិសេសដទៃទៀតដែល មិនអាចធ្វើការបោះឆ្នោតកើត រដ្ឋសភាអាចប្រកាសបន្តនីតិកាលរបស់ខ្លួន មួយដងបានមួយឆ្នាំ តាមសំណើរបស់ព្រះមហាក្សត្រ។\n\nការប្រកាសបន្តនីតិកាលរបស់រដ្ឋសភា ត្រូវសម្រេចដោយមតិយល់ព្រម ពីរភាគបីយ៉ាងតិច នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 79
      , isNew = False
      , content = "អាណត្តិនៃសមាជិករដ្ឋសភា មានវិសមិតភាពជាមួយការបំពេញមុខងារសាធារណៈជាសកម្ម និងជាមួយមុខងារជាសមាជិក នៃស្ថាប័នដទៃទៀត ដែលមានចែងក្នុងរដ្ឋធម្មនុញ្ញនេះ វៀរលែងតែទៅបំពេញមុខងារក្នុង\u{200B}\u{200B}គណៈ\u{200B}រដ្ឋមន្ត្រីនៃរាជរដ្ឋាភិបាល។\n\nក្នុងករណីនេះ សមាជិករដ្ឋសភារូបនោះមានឋានៈជាសមាជិក រដ្ឋសភាធម្ម\u{200B}តា ប៉ុន្តែមិនត្រូវមានមុខតំណែងអ្វីទាំងអស់ក្នុងគណៈកម្មាធិការ\u{200B}\u{200B}អចិ-ន្ត្រៃយ៍ និងក្នុងគណៈកម្មការផ្សេងៗនៃរដ្ឋសភា។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 80
      , isNew = False
      , content = "តំណាងរាស្រ្តមានអភ័យឯកសិទ្ធិសភា។\n\nតំណាងរាស្ត្ររូបណាក៏ដោយ មិនអាចត្រូវបានចោទប្រកាន់ ចាប់ខ្លួន ឃាត់ខ្លួន ឬឃុំខ្លួន ដោយហេតុពីបានសំដែងយោបល់ ឬបញ្ចេញមតិ ក្នុងការបំពេញមុខងាររបស់ខ្លួនសោះឡើយ។\n\nការចោទប្រកាន់ ការចាប់ខ្លួន ការឃាត់ខ្លួន ឬការឃុំខ្លួនសមាជិក ណាមួយនៃរដ្ឋសភានឹងអាចធ្វើទៅកើត លុះត្រាតែមានការយល់ព្រមពី\u{200B}រដ្ឋសភា ឬពីគណៈកម្មាធិការអចិន្ត្រៃយ៍របស់រដ្ឋសភា ក្នុងចន្លោះសម័យប្រជុំ នៃរដ្ឋសភា វៀរលែងតែក្នុងករណីបទល្មើសព្រហ្មទណ្ឌជាក់ស្តែង។ ក្នុងករណីខាង\u{200B}ក្រោយនេះក្រសួងមានសមត្ថកិច្ច ត្រូវធ្វើសេចក្តីរាយការណ៍ ជូនរដ្ឋសភា ឬជូនគណៈកម្មាធិការអចិន្ត្រៃយ៍របស់រដ្ឋសភាជាបន្ទាន់ដើម្បីសម្រេច។\n\nសេចក្តីសម្រេចរបស់គណៈកម្មាធិការអចិន្ត្រៃយ៍របស់រដ្ឋសភា ត្រូវដាក់ជូនសម័យប្រជុំរដ្ឋសភាខាងមុខ ដើម្បីអនុម័តតាមមតិភាគច្រើន ពីរភាគបី នៃសមាជិករដ្ឋសភាទាំងមូល។\n\nក្នុងករណីទាំងអស់ខាងលើនេះ ការឃុំខ្លួន ការចោទប្រកាន់ តំណាងរាស្ត្រ\u{200B}ណាមួយត្រូវផ្អាក ប្រសិនបើរដ្ឋសភាបានបញ្ចេញមតិឱ្យផ្អាក តាមមតិភាគច្រើនបីភាគបួន នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 81
      , isNew = False
      , content = "រដ្ឋសភាមានថវិកាស្វយ័ត សម្រាប់ដំណើរការ។\n\nតំណាងរាស្ត្រត្រូវទទួលប្រាក់បំណាច់។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 82
      , isNew = True
      , content = "រដ្ឋសភាបើកសម័យប្រជុំដំបូង ហុកសិបថ្ងៃយ៉ាងយូរក្រោយ ពេលបោះឆ្នោត តាមការកោះប្រជុំរបស់ព្រះមហាក្សត្រ។\n\nមុនចាប់ផ្តើមការងាររបស់ខ្លួន រដ្ឋសភាត្រូវប្រកាស សុពលភាព នៃអាណត្តិ\u{200B}របស់សមាជិកនីមួយៗ ត្រូវបោះឆ្នោតជ្រើសរើសដាច់ដោយឡែក ពីគ្នានូវប្រធាន អនុប្រធានរដ្ឋសភា និងសមាជិកទាំងអស់នៃគណៈកម្មការនានារបស់រដ្ឋសភា ដោយមតិភាគច្រើនដាច់ខាត នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។\n\nប្រធានរដ្ឋសភា ត្រូវបោះឆ្នោតជ្រើសរើសចេញពីសមាជិករដ្ឋសភា ដែលមានសញ្ជាតិខ្មែរមួយគត់។\n\nរដ្ឋសភាត្រូវអនុម័តបទបញ្ជាផ្ទៃក្នុង ដោយមតិភាគច្រើនដាច់ខាត នៃចំនួន\u{200B}សមាជិករដ្ឋសភាទាំងមូល។\n\nតំណាងរាស្រ្តទាំងអស់ត្រូវធ្វើសច្ចាប្រណិធានមុនចូលកាន់ តំណែង ដូចមានខ្លឹមសារចែងក្នុងឧបសម្ព័ន្ធទី៥ នៃរដ្ឋធម្មនុញ្ញ។"
      , referenceNumber = 15
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 83
      , isNew = False
      , content = "រដ្ឋសភាប្រជុំជាសាមញ្ញពីរដងក្នុងមួយឆ្នាំ។\n\nសម័យប្រជុំនីមួយៗ មានថិរវេលាយ៉ាងតិចបីខែ។ បើមាន សំណូមពរពីព្រះមហាក្សត្រ ឬសេចក្តីស្នើសុំពីនាយករដ្ឋមន្ត្រី ឬពីសមាជិករដ្ឋសភាចំនួនមួយភាគបីយ៉ាងតិចគណៈកម្មាធិការអចិន្ត្រៃយ៍រដ្ឋសភា កោះប្រជុំរដ្ឋសភាជាវិសាមញ្ញ។\n\nក្នុងករណីនេះ របៀបវារៈជាក់លាក់នៃសម័យប្រជុំជាវិសាមញ្ញ ត្រូវផ្សាយដល់ប្រជារាស្រ្តជាមួយនឹងថ្ងៃកំណត់ប្រជុំ។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 84
      , isNew = False
      , content = "នៅចន្លោះសម័យប្រជុំរបស់រដ្ឋសភា គណៈកម្មាធិការអចិន្ត្រៃយ៍ របស់រដ្ឋសភា ទទួលភារកិច្ចចាត់ចែងការងារ។\n\nគណៈកម្មាធិការអចិន្ត្រៃយ៍របស់រដ្ឋសភារួមមានៈ\n\nប្រធានរដ្ឋសភា អនុប្រធានរដ្ឋសភានិងប្រធានគណៈកម្មការទាំងអស់របស់រដ្ឋសភា។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 85
      , isNew = False
      , content = "សម័យប្រជុំរដ្ឋសភា ត្រូវធ្វើនៅរាជធានីនៃព្រះរាជាណាចក្រកម្ពុជា ក្នុងសាលប្រជុំរបស់រដ្ឋសភា លើកលែងតែមានការសម្រេចផ្សេងចុះ ក្នុងលិខិតកោះប្រជុំដោយកាលៈទេសៈតម្រូវ។\n\nក្រៅពីករណីខាងលើ និងក្រៅពីកន្លែង និងពីកាលបរិច្ឆេទ ដែលកំណត់ក្នុងសេចក្តីអញ្ជើញ ការប្រជុំណាក៏ដោយរបស់រដ្ឋសភា ត្រូវទុកជាខុសច្បាប់ ហើយជាអសារសូន្យពេញលក្ខណៈ។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 86
      , isNew = False
      , content = "ក្នុងកាលៈទេសៈដែលប្រទេសជាតិស្ថិតក្នុងភាពអាសន្ន រដ្ឋសភា ប្រជុំរាល់\u{200B}ថ្ងៃជាប់ជាប្រចាំ។ រដ្ឋសភាមានសិទ្ធិសម្រេចបញ្ចប់កាលៈទេសៈ ពិសេស\u{200B}ខាងលើនេះ កាលបើសភាពការណ៍អនុញ្ញាត។\n\nបើរដ្ឋសភាមិនអាចប្រជុំបានទេ ដោយមូលហេតុចាំបាច់ ជាអាទិ៍ នៅពេលដែលកម្លាំងបរទេសចូលមកកាន់កាប់ទឹកដី ការប្រកាសភាពអាសន្ន ត្រូវបន្តទៅមុខជាស្វ័យប្រវត្តិ។\n\nនៅពេលដែលប្រទេសជាតិឋិតក្នុងភាពអាសន្ន រដ្ឋសភាមិនអាចត្រូវរំលាយបានឡើយ។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 87
      , isNew = False
      , content = "ប្រធានរដ្ឋសភាដឹកនាំអង្គប្រជុំរបស់រដ្ឋសភា ទទួលអាញ្ញត្តិច្បាប់ និងសេចក្តី\u{200B}សម្រេចចិត្តទាំងឡាយ ដែលរដ្ឋសភាបានអនុម័ត រ៉ាប់រងការអនុវត្តបទបញ្ជាផ្ទៃក្នុងរបស់រដ្ឋសភា និងចាត់ចែងការទាក់ទងអន្តរជាតិទាំងឡាយរបស់រដ្ឋសភា។\n\nក្នុងករណីដែលប្រធានរដ្ឋសភាមានធុរៈមិនអាចបំពេញមុខងារ បានដោយ\u{200B}ហេតុមកពីមានជំងឺ ឬបំពេញមុខងារជាប្រមុខរដ្ឋស្តីទី ឬជាព្រះរាជា\u{200B}នុសិទ្ធិ ឬបំពេញបេសកកម្មនៅបរទេស អនុប្រធានរដ្ឋសភាមួយរូប ត្រូវទទួលភារកិច្ចចាត់ចែងការងារជំនួស។\n\nក្នុងករណីដែលប្រធាន ឬអនុប្រធានរដ្ឋសភាលាលែងពីមុខតំណែង ឬទទួលអនិច្ចកម្ម រដ្ឋសភាត្រូវបោះឆ្នោតជ្រើសតាំងប្រធាន ឬអនុប្រធានថ្មី។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 88
      , isNew = True
      , content = "ការប្រជុំរដ្ឋសភាត្រូវធ្វើជាសាធារណៈ។\n\nរដ្ឋសភាអាចប្រជុំជាសម្ងាត់បាន តាមការសុំស្នើពីប្រធាន ឬពីសមាជិកចំនួនមួយភាគដប់យ៉ាងតិច ពីព្រះមហាក្សត្រ ឬពីនាយករដ្ឋមន្ត្រី។\n\nការប្រជុំរដ្ឋសភានឹងយកជាការបានលុះត្រាតែមានៈ\n\nក-កូរ៉ុមលើសពីពីរភាគបី នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល សម្រាប់ការអនុម័ត\u{200B}ទាំងឡាយណា ដែលតម្រូវឱ្យយកមតិភាគច្រើនពីរភាគបី នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។\n\nខ-កូរ៉ុមលើសពីពាក់កណ្តាលនៃចំនួនសមាជិករដ្ឋសភាទាំងមូល សម្រាប់ការអនុម័តទាំងឡាយណា ដែលតម្រូវឱ្យយកមតិភាគច្រើនដាច់ខាត នៃចំនួន\u{200B}សមាជិករដ្ឋសភាទាំងមូល។"
      , referenceNumber = 16
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 89
      , isNew = True
      , content = "តាមការស្នើសុំពីសមាជិកចំនួនមួយភាគដប់យ៉ាងតិច រដ្ឋសភា អាចអញ្ជើញសមាជិករាជរដ្ឋាភិបាលមួយរូប ឬច្រើនរូប អមដោយឥស្សរជនជាអ្នកជំនាញក្នុងវិស័យណាមួយមកបំភ្លឺរដ្ឋសភា អំពីបញ្ហាដែលមានសារៈ\u{200B}សំខាន់\u{200B}ពិសេស។"
      , referenceNumber = 17
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 90
      , isNew = True
      , content = "រដ្ឋសភាជាអង្គការដែលមានអំណាចនីតិប្បញ្ញត្តិ ហើយបំពេញភារកិច្ចរបស់ខ្លួន ដូចបានកំណត់ក្នុងរដ្ឋធម្មនុញ្ញ និងច្បាប់ជាធរមាន។\n\nរដ្ឋសភាអនុម័តថវិកាជាតិ ផែនការរដ្ឋ ការឱ្យរដ្ឋខ្ចីប្រាក់ពីគេ ការឱ្យរដ្ឋឱ្យប្រាក់គេខ្ចី ការសន្យានានាផ្នែកហិរញ្ញវត្ថុ និងការបង្កើត កែប្រែ ឬ លុបចោលពន្ធដារ។\n\nរដ្ឋសភាឱ្យសេចក្តីយល់ព្រមចំពោះគណនីរដ្ឋបាល។ រដ្ឋសភាអនុម័ត\u{200B}ច្បាប់\u{200B}\u{200B}ស្តីពីការលើកលែងទោសជាទូទៅ។\n\nរដ្ឋសភាអនុម័តយល់ព្រម ឬលុបចោលសន្ធិសញ្ញា ឬអនុសញ្ញា អន្តរជាតិ។\n\nរដ្ឋសភាអនុម័តច្បាប់ស្តីពីការប្រកាសសង្គ្រាម។\n\nការអនុម័តខាងលើនេះ ប្រព្រឹត្តទៅដោយមតិភាគច្រើនដាច់ខាត នៃចំនួន\u{200B}សមាជិករដ្ឋសភាទាំងមូល។\n\nរដ្ឋសភាបោះឆ្នោតទុកចិត្តដល់រាជរដ្ឋាភិបាល តាមមតិភាគច្រើនដាច់ខាតនៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។"
      , referenceNumber = 18
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 91
      , isNew = True
      , content = "សមាជិកព្រឹទ្ធសភា សមាជិករដ្ឋសភា និងនាយករដ្ឋមន្ត្រីមាន សិទ្ធិផ្តួចផ្តើម\u{200B}គំនិតធ្វើច្បាប់។\n\nតំណាងរាស្ត្រមានសិទ្ធិស្នើធ្វើវិសោធនកម្មច្បាប់ ប៉ុន្តែសំណើ នេះមិនអាចទទួលយកបានទេ បើវិសោធនកម្មនោះសំដៅបន្ថយប្រាក់ចំណូលសាធា-រណៈ ឬបន្ថែមបន្ទុកលើប្រជាពលរដ្ឋ។"
      , referenceNumber = 19
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 92
      , isNew = False
      , content = "ការអនុម័តទាំងឡាយរបស់រដ្ឋសភា ដែលផ្ទុយនឹងគោលការណ៍ រក្សាការពារ ឯករាជ្យ អធិបតេយ្យ បូរណភាពទឹកដី នៃព្រះរាជាណាចក្រកម្ពុជា ហើយដែលនាំឱ្យប៉ះពាល់ដល់ឯកភាពនយោបាយ ឬការគ្រប់គ្រង រដ្ឋបាល\u{200B}របស់ប្រទេសជាតិនឹងត្រូវចាត់ទុកជាអសារសូន្យ។ ក្រុមប្រឹក្សាធម្មនុញ្ញ ជាអង្គការតែមួយគត់ដែលមានសមត្ថកិច្ចសម្រេចពីមោឃភាពនេះ។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 93
      , isNew = True
      , content = "ច្បាប់ដែលរដ្ឋសភាបានអនុម័ត និងព្រឹទ្ធសភាបានពិនិត្យចប់សព្វគ្រប់រួចហើយ ហើយត្រូវបានព្រះមហាក្សត្រទ្រង់ឡាយព្រះហស្តលេខា ប្រកាសឱ្យប្រើ ត្រូវចូលជាធរមាន នៅរាជធានីភ្នំពេញក្នុងរយៈពេលដប់ថ្ងៃគត់ ក្រោយពីថ្ងៃប្រកាសឱ្យប្រើ និងនៅទូទាំងប្រទេសក្នុងរយៈពេលម្ភៃថ្ងៃគត់ ក្រោយពីថ្ងៃប្រកាសឱ្យប្រើ។ ប៉ុន្តែបើច្បាប់នេះបានចែងថាជាការប្រញាប់ ច្បាប់នេះត្រូវចូលជាធរមានភ្លាមនៅទូទាំងប្រទេសក្រោយថ្ងៃប្រកាសឱ្យ ប្រើ។\n\nច្បាប់ដែលព្រះមហាក្សត្រទ្រង់បានឡាយព្រះហស្តលេខា ប្រកាសឱ្យប្រើ ត្រូវចុះក្នុងរាជកិច្ច និងផ្សព្វផ្សាយនៅទូទាំងប្រទេសឱ្យទាន់តាមពេលកំណត់ខាងលើ។"
      , referenceNumber = 20
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 94
      , isNew = False
      , content = "រដ្ឋសភាបង្កើតគណៈកម្មការផ្សេងៗដែលចាំបាច់។ ការរៀបចំ និងការប្រព្រឹត្តទៅនៃរដ្ឋសភា នឹងមានកំណត់ក្នុងបទបញ្ជាផ្ទៃក្នុងនៃរដ្ឋសភា។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 95
      , isNew = False
      , content = "ក្នុងករណីមានសមាជិករដ្ឋសភាទទួលអនិច្ចកម្ម លាលែង ឬ ប្រាសចាកសមាជិកភាព ដែលកើតមានឡើង៦ខែ យ៉ាងតិច មុនចប់នីតិកាល ត្រូវចាត់ការជ្រើសតាំងជំនួសសមាជិកនោះតាមល័ក្ខខ័ណ្ឌកំណត់ ក្នុងបទបញ្ជា\u{200B}\u{200B}ផ្ទៃក្នុងរដ្ឋសភា និងក្នុងច្បាប់បោះឆ្នោត។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 96
      , isNew = False
      , content = "តំណាងរាស្ត្រ មានសិទ្ធិដាក់សំណួរដល់រាជរដ្ឋាភិបាល។ សំណួរនេះត្រូវសរសេរជាលាយលក្ខណ៍អក្សរ ប្រគល់ជូនតាមរយៈប្រធានរដ្ឋសភា។\n\nចម្លើយអាចធ្វើឡើងដោយរដ្ឋមន្ត្រីមួយរូប ឬច្រើនរូប អាស្រ័យដោយបញ្ហាដែលបានចោទឡើងពាក់ព័ន្ធនឹងការទទួលខុសត្រូវរបស់រដ្ឋមន្ត្រី មួយរូប ឬច្រើនរូប។ បើបញ្ហាពាក់ព័ន្ធដល់នយោបាយទូទៅរបស់រាជរដ្ឋាភិបាល នាយករដ្ឋមន្ត្រីត្រូវឆ្លើយផ្ទាល់ខ្លួន។\n\nចម្លើយរបស់រដ្ឋមន្ត្រី ឬរបស់នាយករដ្ឋមន្ត្រី អាចធ្វើដោយផ្ទាល់មាត់ ឬសរសេរជាលាយលក្ខណ៍អក្សរ។\n\nចម្លើយខាងលើនេះ ត្រូវធ្វើឡើងក្នុងរយៈពេលប្រាំពីរថ្ងៃបន្ទាប់ ពីបានទទួលសំណួរ។\n\nចំពោះចម្លើយផ្ទាល់មាត់ ប្រធានរដ្ឋសភាអាចសម្រេចបើកឱ្យមាន ឬមិនឱ្យមានការជជែកដេញដោល។ បើគ្មានការបើកឱ្យជជែកដេញដោលទេ នោះចម្លើយរបស់រដ្ឋមន្ត្រី ឬនាយករដ្ឋមន្ត្រី នឹងបញ្ចប់សំណួរតែម្តង។\n\nបើមានការបើកឱ្យជជែកដេញដោល ម្ចាស់សំណួរ វាគ្មិនឯទៀត និងរដ្ឋមន្ត្រី\u{200B}ពាក់ព័ន្ធ ឬនាយករដ្ឋមន្ត្រី អាចជជែកប្តូរយោបល់ក្នុងរយៈពេល ដែលមិនអាចលើសពីមួយពេលប្រជុំឡើយ។\n\nរដ្ឋសភាកំណត់ទុកពេលមួយថ្ងៃក្នុងមួយសប្តាហ៍ សម្រាប់ការឆ្លើយសំណួរ។\n\nទោះបីយ៉ាងណាក៏ដោយ សម័យប្រជុំសម្រាប់ឆ្លើយសំណួរខាងលើនេះ មិនអាចបើកលទ្ធភាពឱ្យមានការបោះឆ្នោតប្រភេទណាមួយបានឡើយ ។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 97
      , isNew = False
      , content = "គណៈកម្មការទាំងឡាយរបស់រដ្ឋសភា អាចអញ្ជើញរដ្ឋមន្ត្រី មកបំភ្លឺអំពីបញ្ហាអ្វីមួយដែលពាក់ព័ន្ធនឹងវិស័យទទួលខុសត្រូវរបស់ខ្លួន។"
      , referenceNumber = 0
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 98
      , isNew = True
      , content = "រដ្ឋសភាអាចទម្លាក់សមាជិកគណៈរដ្ឋមន្ត្រី ឬទម្លាក់រាជរដ្ឋាភិបាល ពីតំណែង ដោយអនុម័តញត្តិបន្ទោស តាមសំឡេងឆ្នោតភាគច្រើនដាច់ខាត នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។\n\nញត្តិបន្ទោសរាជរដ្ឋាភិបាល ត្រូវបានលើកឡើងជូនរដ្ឋសភា ដោយតំណាង\u{200B}រាស្ត្រចំនួនសាមសិបនាក់ ទើបរដ្ឋសភាអាចលើកយកមកពិភាក្សាបាន។"
      , referenceNumber = 21
      , chapterIndex = 7
      , tags = [ "🚧" ]
      }
    , { index = 99
      , isNew = True
      , content = "ព្រឹទ្ធសភាជាអង្គការដែលមានអំណាចនីតិប្បញ្ញត្តិ ហើយបំពេញភារកិច្ចរបស់ខ្លួន ដូចបានកំណត់ក្នុងរដ្ឋធម្មនុញ្ញ និងច្បាប់ជាធរមាន។\n\nព្រឹទ្ធសភាមានចំនួនសមាជិកយ៉ាងច្រើន ស្មើនឹងពាក់កណ្តាល នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។\n\nសមាជិកព្រឹទ្ធសភាត្រូវចាត់តាំងខ្លះ និងត្រូវជ្រើសតាំងដោយ ការបោះឆ្នោតអសកលខ្លះ។\n\nសមាជិកព្រឹទ្ធសភាអាចត្រូវបានចាត់តាំង និងជ្រើសតាំងសាជា ថ្មីបាន។ អ្នកដែលមានសិទ្ធិឈរឈ្មោះជាបេក្ខជនព្រឹទ្ធសភា គឺជាប្រជាពលរដ្ឋខ្មែរទាំងពីរភេទ ដែលមានសិទ្ធិបោះឆ្នោត មានអាយុយ៉ាងតិច ៤០ឆ្នាំ មានសញ្ជាតិខ្មែរតាំងពីកំណើត។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 100
      , isNew = True
      , content = "សមាជិកព្រឹទ្ធសភាចំនួន២រូប ត្រូវបានចាត់តាំងដោយព្រះមហាក្សត្រ។\n\nសមាជិកព្រឹទ្ធសភាចំនួន ២រូប ត្រូវបានរដ្ឋសភាជ្រើសតាំងតាម មតិភាគច្រើនដោយប្រៀប។\n\nរីឯសមាជិកព្រឹទ្ធសភាឯទៀត ត្រូវបានជ្រើសតាំងដោយការ បោះឆ្នោតអសកល។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 101
      , isNew = True
      , content = "ការរៀបចំបែបបទ និងការប្រព្រឹត្តទៅនៃការចាត់តាំង និងការបោះឆ្នោតជ្រើសតាំងសមាជិកព្រឹទ្ធសភា ព្រមទាំងការកំណត់ អំពីអ្នកបោះឆ្នោត អង្គបោះឆ្នោត និងមណ្ឌលបោះឆ្នោត ត្រូវចែងក្នុងច្បាប់មួយ។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 102
      , isNew = True
      , content = "នីតិកាលរបស់ព្រឹទ្ធសភាមានកំណត់ ៦ឆ្នាំ ហើយត្រូវផុតកំណត់ នៅពេលដែលព្រឹទ្ធសភាថ្មី ចូលកាន់តំណែង។\n\nក្នុងពេលមានសង្គ្រាម ឬក្នុងកាលៈទេសៈពិសេសដទៃទៀត ដែលមិនអាច\u{200B}ធ្វើការបោះឆ្នោតកើត ព្រឹទ្ធសភាអាចប្រកាសបន្តនីតិកាល របស់ខ្លួនមួយដងបានមួយឆ្នាំ តាមសំណើរបស់ព្រះមហាក្សត្រ។\n\nការប្រកាសបន្តនីតិកាលរបស់ព្រឹទ្ធសភា ត្រូវសម្រេចដោយមតិយល់ព្រម ពីរភាគបីយ៉ាងតិច នៃចំនួនសមាជិកព្រឹទ្ធសភាទាំងមូល។\n\nក្នុងកាលៈទេសៈដូចបានរៀបរាប់ខាងលើ ព្រឹទ្ធសភាប្រជុំ រាល់ថ្ងៃជាប់ជាប្រចាំ។ ព្រឹទ្ធសភាមានសិទ្ធិសម្រេចបញ្ចប់កាលៈទេសៈពិសេសខាងលើនេះ \u{200B}កាលបើសភាពការណ៍អនុញ្ញាត។ ប៉ុន្តែការសម្រេចបញ្ចប់កាលៈទេសៈ\u{200B}ពិសេសដែលប្រទេសជាតិស្ថិតក្នុងភាពអាសន្ន ព្រឹទ្ធសភាត្រូវសម្រេចរួមគ្នាជាមួយរដ្ឋសភា ក្នុងសមាជរដ្ឋសភា និងព្រឹទ្ធសភា វៀរលែងតែការអនុវត្ត\u{200B}មាត្រា ៨៦ នៃរដ្ឋធម្មនុញ្ញ។\n\nបើព្រឹទ្ធសភាមិនអាចប្រជុំបានទេ ដោយមូលហេតុចាំបាច់ជាអាទិ៍ នៅពេល\u{200B}ដែលកម្លាំងបរទេសចូលមកកាន់កាប់ទឹកដី ការប្រកាសភាពអាសន្ន ត្រូវបន្តទៅមុខជាស្វ័យប្រវត្តិ។"
      , referenceNumber = 23
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 103
      , isNew = True
      , content = "អាណត្តិនៃសមាជិកព្រឹទ្ធសភា មានវិសមិតភាពជាមួយការបំពេញមុខងារសាធារណៈជាសកម្ម ជាមួយមុខងារជាតំណាងរាស្ត្រ និងជាមួយមុខងារជាសមាជិកស្ថាប័នដទៃទៀតដែលមានចែងក្នុងរដ្ឋធម្មនុញ្ញ។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 104
      , isNew = True
      , content = "សមាជិកព្រឹទ្ធសភាមានអភ័យឯកសិទ្ធិសភា។\n\nសមាជិកព្រឹទ្ធសភារូបណាក៏ដោយមិនអាចត្រូវបានចោទប្រកាន់ ចាប់ខ្លួនឃាត់ខ្លួន ឬឃុំខ្លួន ដោយហេតុពីបានសំដែងយោបល់ ឬបញ្ចេញមតិក្នុងការបំពេញមុខងាររបស់ខ្លួនសោះឡើយ។ ការចោទប្រកាន់ ការចាប់ខ្លួន ការឃាត់ខ្លួន ឬការឃុំខ្លួនសមាជិកណាមួយនៃព្រឹទ្ធសភា នឹងអាចធ្វើទៅកើត លុះត្រាតែមានការយល់ព្រមពីព្រឹទ្ធសភា ឬពីគណៈកម្មាធិការ\u{200B}អចិ-\u{200B}ន្ត្រៃយ៍របស់ព្រឹទ្ធសភា ក្នុងចន្លោះសម័យប្រជុំនៃព្រឹទ្ធសភា វៀរលែង តែក្នុងករណីបទល្មើសព្រហ្មទណ្ឌជាក់ស្តែង។ ក្នុងករណីចុងក្រោយនេះ\n\nក្រសួងមានសមត្ថកិច្ច ត្រូវធ្វើសេចក្តីរាយការណ៍ជូនព្រឹទ្ធសភា ឬជូនគណៈ កម្មាធិការអចិន្ត្រៃយ៍របស់ព្រឹទ្ធសភាជាបន្ទាន់ ដើម្បីសម្រេច។\n\nសេចក្តីសម្រេចរបស់គណៈកម្មាធិការអចិន្ត្រៃយ៍របស់ព្រឹទ្ធសភា ត្រូវដាក់ជូនសម័យប្រជុំព្រឹទ្ធសភាខាងមុខ ដើម្បីអនុម័តតាមមតិភាគច្រើន ពីរភាគបី នៃសមាជិកព្រឹទ្ធសភាទាំងមូល។\n\nក្នុងករណីទាំងអស់ខាងលើនេះ ការឃុំខ្លួន ការចោទប្រកាន់ សមាជិកព្រឹទ្ធសភាណាមួយត្រូវផ្អាក ប្រសិនបើព្រឹទ្ធសភាបានបញ្ចេញមតិ ឱ្យផ្អាកតាមមតិភាគច្រើន បីភាគបួន នៃសមាជិកព្រឹទ្ធសភាទាំងមូល។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 105
      , isNew = True
      , content = "ព្រឹទ្ធសភាមានថវិកាស្វយ័តសម្រាប់ដំណើរការ។\n\nសមាជិកព្រឹទ្ធសភា ត្រូវទទួលប្រាក់បំណាច់។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 106
      , isNew = True
      , content = "ព្រឹទ្ធសភាបើកសម័យប្រជុំដំបូង ហុកសិបថ្ងៃយ៉ាងយូរ ក្រោយ\u{200B}ពេលបោះឆ្នោត តាមការកោះប្រជុំរបស់ព្រះមហាក្សត្រ។\n\nមុនចាប់ផ្តើមការងាររបស់ខ្លួន ព្រឹទ្ធសភាត្រូវប្រកាស សុពលភាព នៃអាណត្តិ\u{200B}របស់សមាជិកនីមួយៗ និងត្រូវបោះឆ្នោតជ្រើសរើសដាច់ដោយ ឡែកពីគ្នានូវ ប្រធាន អនុប្រធាន ព្រឹទ្ធសភា និងសមាជិកទាំងអស់នៃ\u{200B}គណៈ កម្មការនានារបស់ព្រឹទ្ធសភា ដោយមតិភាគច្រើនដាច់ខាតនៃចំនួនសមា-\u{200B}ជិក ព្រឹទ្ធសភាទាំងមូល។\n\nប្រធានព្រឹទ្ធសភា ត្រូវបោះឆ្នោតជ្រើសរើសចេញពីសមាជិកតព្រឹទ្ធសភា ដែលមានសញ្ជាតិខ្មែរតែមួយគត់។\n\nសមាជិកព្រឹទ្ធសភាទាំងអស់ ត្រូវធ្វើសច្ចាប្រណិធាន មុនចូល\u{200B}កាន់តំណែង ដូច\u{200B}មាន\u{200B}ខ្លឹមសារ\u{200B}ចែងក្នុង\u{200B}ឧបសម្ព័ន្ធទី ៧ នៃរដ្ឋធម្មនុញ្ញ។"
      , referenceNumber = 24
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 107
      , isNew = True
      , content = "ព្រឹទ្ធសភាប្រជុំជាសាមញ្ញពីរដងក្នុងមួយឆ្នាំ។\n\nសម័យប្រជុំនីមួយៗ មានថិរវេលាយ៉ាងតិចបីខែ។ បើមាន សំណូមពរពីព្រះមហាក្សត្រ ឬសេចក្តីស្នើសុំពីនាយករដ្ឋមន្ត្រី ឬពីសមាជិកព្រឹទ្ធសភា ចំនួនមួយភាគបីយ៉ាងតិច ព្រឹទ្ធសភាកោះប្រជុំជាវិសាមញ្ញ។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 108
      , isNew = True
      , content = "នៅចន្លោះសម័យប្រជុំរបស់ព្រឹទ្ធសភា គណៈកម្មាធិការអចិន្ត្រៃយ៍ របស់ព្រឹទ្ធសភា ទទួលភារកិច្ចចាត់ចែងការងារ។\n\nគណៈកម្មាធិការអចិន្ត្រៃយ៍របស់ព្រឹទ្ធសភារួមមានៈ ប្រធានព្រឹទ្ធសភា អនុប្រធានព្រឹទ្ធសភា និងប្រធានគណៈកម្មការទាំងអស់របស់ព្រឹទ្ធសភា។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 109
      , isNew = True
      , content = "សម័យប្រជុំព្រឹទ្ធសភា ត្រូវធ្វើនៅរាជធានីនៃព្រះរាជាណាចក្រកម្ពុជា ក្នុងសាលប្រជុំរបស់ព្រឹទ្ធសភា លើកលែងតែមានការសម្រេចផ្សេង ចុះក្នុងលិខិតកោះប្រជុំដោយកាលៈទេសៈតម្រូវ។\n\nក្រៅពីករណីខាងលើ និងក្រៅពីកន្លែង និងកាលបរិច្ឆេទ ដែលកំណត់ក្នុងសេចក្តីអញ្ជើញ ការប្រជុំណាក៏ដោយរបស់ព្រឹទ្ធសភា ត្រូវទុកជាខុសច្បាប់ ហើយអាសារសូន្យពេញលក្ខណៈ។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 110
      , isNew = True
      , content = "ប្រធានព្រឹទ្ធសភាដឹកនាំអង្គប្រជុំរបស់ព្រឹទ្ធសភា ទទួលអាញត្តិច្បាប់ និងសេចក្តីសម្រេចចិត្តទាំងឡាយ ដែលព្រឹទ្ធសភាបានអនុម័ត រ៉ាប់រងការអនុវត្តបទបញ្ជាផ្ទៃក្នុងរបស់ព្រឹទ្ធសភា និងចាត់ចែងការទាក់ទងអន្តរជាតិ ទាំងឡាយរបស់ព្រឹទ្ធសភា។\n\nក្នុងករណីដែលប្រធានព្រឹទ្ធសភាមានធុរៈមិនអាចបំពេញ មុខងារបាន ដោយ\u{200B}ហេតុមកពីមានជំងឺ ឬបំពេញមុខងារជា ប្រមុខរដ្ឋស្តីទី ឬ ជាព្រះរាជានុសិទ្ធិ ឬបំពេញបេសកកម្មនៅបរទេស អនុប្រធានព្រឹទ្ធសភា មួយរូប ត្រូវទទួលភារកិច្ចចាត់ចែងការងារជំនួស។\n\nក្នុងករណីដែលប្រធាន ឬអនុប្រធានព្រឹទ្ធសភាលាលែងពីមុខតំណែង ឬទទួលអនិច្ចកម្ម ព្រឹទ្ធសភាត្រូវបោះឆ្នោតជ្រើសតាំងប្រធាន ឬ អនុប្រធានថ្មី។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 111
      , isNew = True
      , content = "ការប្រជុំព្រឹទ្ធសភា ត្រូវធ្វើជាសាធារណៈ។\n\nព្រឹទ្ធសភាអាចប្រជុំជាសម្ងាត់បានតាមការស្នើសុំពីប្រធាន ឬពីសមាជិកចំនួន\u{200B}មួយ\u{200B}ភាគ\u{200B}ដប់\u{200B}យ៉ាង\u{200B}តិចពីព្រះមហាក្សត្រ ពី\u{200B}នាយ\u{200B}ក\u{200B}រដ្ឋមន្ត្រី ឬពីប្រធានរដ្ឋសភា។\n\nការ\u{200B}ប្រជុំព្រឹទ្ធ\u{200B}សភា\u{200B}នឹង\u{200B}យក\u{200B}ជាការ\u{200B}បាន លុះត្រាតែមានៈ\n\nក-កូរ៉ុមលើសពីពីរភាគបីនៃសមាជិកព្រឹទ្ធសភាទាំងមូល សម្រាប់ការអនុ-ម័ត\u{200B}\u{200B}ទាំងឡាយណា ដែលតម្រូវឱ្យយកមតិភាគច្រើនពីរភាគបី នៃចំនួន\u{200B}សមាជិកព្រឹទ្ធសភាទាំងមូល ។\n\nខ-កូរ៉ុមលើសពីពាក់កណ្តាលនៃចំនួនសមាជិកព្រឹទ្ធសភាទាំងមូល សម្រាប់\u{200B}\u{200B}ការអនុម័តទាំងឡាយណា ដែលតម្រូវឱ្យយកមតិភាគច្រើនដោយ ប្រៀប ឬយកមតិភាគច្រើនដាច់ខាតនៃចំនួនសមាជិកព្រឹទ្ធសភាទាំងមូល។\n\nចំនួនសំឡេង ដែលតម្រូវសម្រាប់រដ្ឋសភាអនុម័តយល់ព្រម ហើយដែលបានកំណត់ក្នុងរដ្ឋធម្មនុញ្ញ ត្រូវយកមកប្រើសម្រាប់ព្រឹទ្ធសភាផងដែរ។"
      , referenceNumber = 25
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 112
      , isNew = True
      , content = "ព្រឹទ្ធសភាមានភារកិច្ចសម្របសម្រួលការងាររវាងរដ្ឋសភា និងរដ្ឋាភិបាល។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 113
      , isNew = True
      , content = "ព្រឹទ្ធសភាពិនិត្យ ហើយឱ្យយោបល់ក្នុងរយៈពេលមួយខែយ៉ាងយូរ លើ\u{200B}សេច\u{200B}ក្តីព្រាងច្បាប់ ឬសេចក្តីស្នើច្បាប់ ដែលរដ្ឋសភាបានអនុម័តយល់ព្រមលើកដំបូងរួចហើយ ព្រមទាំងលើបញ្ហាទាំងពួង ដែលរដ្ឋសភាបានដាក់ឱ្យពិនិត្យ។ បើជាការប្រញាប់ រយៈពេលនោះ ត្រូវបន្ថយមកនៅ ត្រឹមតែប្រាំថ្ងៃ។\n\nបើព្រឹទ្ធសភាបានឱ្យយោបល់យល់ព្រម ឬពុំបានឱ្យយោបល់សោះ ក្នុងរយៈ\u{200B}ពេលដែលមានកំណត់ទុកហើយនោះទេ ច្បាប់ដែលរដ្ឋសភាបានអនុម័តយល់ព្រមហើយនោះ នឹងត្រូវបានយកទៅប្រកាសឱ្យប្រើ។\n\nបើព្រឹទ្ធសភាសុំឱ្យកែសម្រួលសេចក្តីព្រាងច្បាប់ ឬសេចក្តីស្នើច្បាប់នោះ រដ្ឋសភាត្រូវយកមកពិចារណាភ្លាមជាលើកទីពីរ។ រដ្ឋសភាត្រូវពិនិត្យ និងសម្រេចតែត្រង់បទប្បញ្ញត្តិ ឬចំណុចណាដែលព្រឹទ្ធសភា សុំឱ្យកែសម្រួល ដោយបដិសេធចោលទាំងមូល ឬទុកជាបានការខ្លះ។\n\nការបង្វិលទៅបង្វិលមករវាងព្រឹទ្ធសភា និងរដ្ឋសភា ត្រូវធ្វើតែក្នុងរយៈពេល\u{200B}\u{200B}មួយខែ។ រយៈពេលនេះ ត្រូវបន្ថយមកត្រឹមដប់ថ្ងៃ បើត្រូវពិនិត្យសម្រេចពីថវិកាជាតិ និងហិរញ្ញវត្ថុ ហើយមកត្រឹមតែពីរថ្ងៃបើជាការ ប្រញាប់។\n\nបើរដ្ឋសភាទុកឱ្យហួសរយៈពេលកំណត់ ឬពន្យារពេលដែលកំណត់ទុកសម្រាប់\u{200B}ពិនិត្យនោះ រយៈពេលជាគោលការណ៍សម្រាប់រដ្ឋសភា និងព្រឹទ្ធ-\u{200B}សភា\u{200B}ត្រូវបន្ថែមឱ្យស្មើគ្នាដែរ។\n\nបើព្រឹទ្ធសភាបដិសេធសេចក្តីព្រាងច្បាប់ ឬសេចក្តីស្នើច្បាប់នោះ ជាអសារ\u{200B}បង់ រដ្ឋសភាមិនអាចនឹងយកមកពិចារណាជាលើកទីពីរបាន មុនរយៈពេលមួយខែទេ។ រយៈពេលនេះ ត្រូវបន្ថយមកត្រឹមដប់ប្រាំថ្ងៃ បើពិនិត្យ ពីថវិកាជាតិ និងហិរញ្ញវត្ថុ ហើយមកត្រឹមតែបួនថ្ងៃ បើជាការប្រញាប់។\n\nក្នុងការពិនិត្យសេចក្តីព្រាងច្បាប់ ឬសេចក្តីស្នើច្បាប់ជាលើកទី២នេះ រដ្ឋសភាត្រូវអនុម័តដោយវិធីបោះឆ្នោតចំហ និងយកតាមមតិភាគច្រើនដាច់ខាត។\n\nសេចក្តីព្រាងច្បាប់ ឬសេចក្តីស្នើច្បាប់ណាដែលបានសម្រេច ដូចខាងលើនេះហើយនោះ នឹងត្រូវបានយកទៅប្រកាសឱ្យប្រើ។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 114
      , isNew = True
      , content = "ព្រឹទ្ធសភាបង្កើតគណៈកម្មការផ្សេងៗ ដែលចាំបាច់ ។ ការ រៀបចំ និងការប្រព្រឹត្តទៅនៃព្រឹទ្ធសភានឹងមានកំណត់ក្នុងបទបញ្ជាផ្ទៃក្នុង របស់ព្រឹទ្ធសភា ។ បទបញ្ជាផ្ទៃក្នុងនេះ ត្រូវអនុម័តយល់ព្រមដោយសំឡេង ភាគច្រើនដាច់ខាតនៃចំនួនសមាជិកព្រឹទ្ធសភាទាំងមូល។"
      , referenceNumber = 26
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 115
      , isNew = True
      , content = "ក្នុងករណីមានសមាជិកព្រឹទ្ធសភាទទួលអនិច្ចកម្ម លាលែង ឬប្រាសចាកសមាជិកភាព ដែលកើតមានឡើងប្រាំមួយខែ យ៉ាងតិចមុនចប់នីតិកាល ត្រូវចាត់តាំង ឬជ្រើសតាំងជំនួសសមាជិកនោះ តាមល័ក្ខខ័ណ្ឌកំណត់ក្នុងបទបញ្ជាផ្ទៃក្នុងនៃព្រឹទ្ធសភា និងក្នុងច្បាប់ស្តីពីការចាត់តាំង និងការបោះឆ្នោតជ្រើសតាំងសមាជិកព្រឹទ្ធសភា។"
      , referenceNumber = 0
      , chapterIndex = 8
      , tags = [ "🚧" ]
      }
    , { index = 116
      , isNew = True
      , content = "ក្នុងករណីចាំបាច់ រដ្ឋសភា និងព្រឹទ្ធសភាអាចប្រជុំរួមគ្នាជាសមាជ ដើម្បីដោះស្រាយបញ្ហាសំខាន់ៗ របស់ប្រទេសជាតិ។"
      , referenceNumber = 0
      , chapterIndex = 9
      , tags = [ "🚧" ]
      }
    , { index = 117
      , isNew = True
      , content = "បញ្ហាសំខាន់ៗ របស់ប្រទេសជាតិ ដូចមានចែងក្នុងមាត្រា១១៦ ថ្មី ខាងលើ ព្រមទាំងការរៀបចំ និងការប្រព្រឹត្តទៅនៃសមាជ នឹងត្រូវកំណត់ ក្នុងច្បាប់មួយ។"
      , referenceNumber = 0
      , chapterIndex = 9
      , tags = [ "🚧" ]
      }
    , { index = 12
      , isNew = True
      , content = "សមាជិកទាំងឡាយនៃរាជរដ្ឋាភិបាលមិនអាចយកសំអាងនៃ សេចក្ដីបង្គាប់ ដោយលាយលក្ខណ៍អក្សរ ឬដោយវាចាអំពីនរណាមួយ ដើម្បីដោះសាឱ្យរួចខ្លួនពីការទទួលខុសត្រូវរបស់ខ្លួនបានឡើយ។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 118
      , isNew = True
      , content = "គណៈរដ្ឋមន្ត្រីជារាជរដ្ឋាភិបាលនៃព្រះរាជាណាចក្រកម្ពុជា។\n\nគណៈរដ្ឋមន្ត្រី ត្រូវបានដឹកនាំដោយនាយករដ្ឋមន្ត្រីមួយរូប អមដោយឧប\u{200B}នាយករដ្ឋមន្ត្រី ព្រមទាំងមានទេសរដ្ឋមន្ត្រី រដ្ឋមន្ត្រី និងរដ្ឋលេខា\u{200B}ធិការ ជាសមាជិក។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 119
      , isNew = True
      , content = "តាមសេចក្ដីស្នើពីគណបក្សដែលមានអាសនៈច្រើនជាងគេក្នុងរដ្ឋសភា ព្រះមហាក្សត្រទ្រង់ចាត់តាំងវរជនមួយរូបជានាយករដ្ឋមន្ត្រី ឱ្យបង្កើតរាជរដ្ឋាភិបាល។ សេចក្ដីស្នើពីគណបក្សដែលមានអាសនៈច្រើនជាងគេក្នុងរដ្ឋសភានេះ ត្រូវចម្លងជូនប្រធានរដ្ឋសភា។ វរជនដែលនឹងត្រូវទទួលបានការចាត់តាំងជានាយករដ្ឋមន្ត្រីនេះ\u{200B} ត្រូវតែ\u{200B}ជា\u{200B}តំណាងរាស្ត្រដែលមានសញ្ជាតិ\u{200B}\u{200B}ខ្មែរតែមួយគត់ និងដែលត្រូវបានជ្រើសរើសចេញពីគណបក្សដែលមានអាសនៈច្រើនជាងគេក្នុងរដ្ឋសភា។ វរជន ដែលត្រូវបានចាត់តាំងនេះនាំសហការីដែលជាតំណាងរាស្រ្ត ឬជាសមាជិកគណបក្សតំណាង\u{200B}នៅក្នុងរដ្ឋសភា ដែលផ្គូផ្គងឱ្យកាន់តំណែងផ្សេងៗក្នុង រាជរដ្ឋាភិបាលទៅសុំសេចក្តីទុកចិត្តពីរដ្ឋសភា។ ការបោះឆ្នោតផ្ដល់សេចក្ដីទុកចិត្តនេះ ត្រូវធ្វើលើបញ្ជីសមាសភាពនៃគណៈរដ្ឋមន្ត្រីទាំងមូល។[30] កាលបើរដ្ឋសភាបានបោះឆ្នោតទុកចិត្តហើយនោះ ព្រះមហាក្សត្រទ្រង់ចេញព្រះរាជក្រឹត្យតែងតាំង គណៈរដ្ឋមន្ត្រីទាំងមូល។\n\nមុនចូលកាន់តំណែង គណៈរដ្ឋមន្ត្រី ត្រូវធ្វើសច្ចាប្រណិធាន ដូចមានខ្លឹមសារចែងក្នុងឧបសម្ព័ន្ធទី ៦។\n\nនៅពេលផុតនីតិកាលនីមួយៗរបស់រដ្ឋសភា រាជរដ្ឋាភិបាលដែលត្រូវចេញពីដំណែង មានតែភារកិច្ចដឹកនាំការងារប្រចាំថ្ងៃតែប៉ុណ្ណោះ រហូតដល់មានរាជរដ្ឋាភិបាលថ្មីចូលកាន់ដំណែង។[31]"
      , referenceNumber = 29
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 120
      , isNew = True
      , content = "មុខងារនៃសមាជិករាជរដ្ឋាភិបាល មានវិសមិតភាព នឹងសកម្មភាពខាងវិជ្ជាជីវៈ ផ្នែកពាណិជ្ជកម្ម ឬឧស្សាហកម្ម ហើយនិងការកាន់តំណែងណាមួយក្នុងមុខងារ\u{200B}សាធារណៈ។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 121
      , isNew = True
      , content = "សមាជិកទាំងឡាយនៃរាជរដ្ឋាភិបាលទទួលខុសត្រូវរួមគ្នា ចំពោះរដ្ឋសភា អំពីនយោបាយទូទៅរបស់រាជរដ្ឋាភិបាល។\n\nសមាជិកមួយរូបៗ នៃរាជរដ្ឋាភិបាលទទួលខុសត្រូវរៀងខ្លួន ចំពោះនាយក\u{200B}រដ្ឋមន្ត្រី និងចំពោះរដ្ឋសភា អំពីការដែលខ្លួនបានប្រព្រឹត្ត។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 123
      , isNew = True
      , content = "គណៈរដ្ឋមន្ត្រី ត្រូវប្រជុំរាល់សប្តាហ៍ ជាប្រជុំធំ ឬជាប្រជុំពិនិត្យ ស្រាវជ្រាវ។\n\nអង្គប្រជុំធំ ត្រូវដឹកនាំដោយនាយករដ្ឋមន្ត្រី។ នាយករដ្ឋមន្ត្រី អាចប្រគល់ភារកិច្ចជូនឧបនាយករដ្ឋមន្ត្រីដឹកនាំអង្គប្រជុំ ពិនិត្យស្រាវជ្រាវ។\n\nកំណត់ហេតុនៃអង្គប្រជុំទាំងអស់របស់គណៈរដ្ឋមន្ត្រី ត្រូវផ្ញើថ្វាយព្រះមហាក្សត្រទ្រង់ជ្រាប។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 124
      , isNew = True
      , content = "នាយករដ្ឋមន្ត្រីអាចរំលែកអំណាចរបស់ខ្លួនឱ្យទៅឧបនាយក រដ្ឋមន្ត្រី ឬសមាជិកណាមួយនៃរាជរដ្ឋាភិបាលបាន។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 125
      , isNew = True
      , content = "ក្នុងករណីដែលនាយករដ្ឋមន្ត្រីអវត្តមានមួយកាលមួយគ្រា នាយករដ្ឋមន្ត្រីត្រូវចាត់តាំងឧបនាយករដ្ឋមន្ត្រីមួយរូប ឱ្យធ្វើជានាយករដ្ឋមន្ត្រីស្ដីទីដើម្បីទទួលភារកិច្ចដឹកនាំគណៈរដ្ឋមន្ត្រីជំនួសជាបណ្ដោះអាសន្ន។\n\nបើតំណែងនាយករដ្ឋមន្ត្រីនៅទំនេរជាស្ថាពរដោយហេតុជាអាទិ៍មកពីការទទួលអនិច្ចកម្ម ឬការលាលែងពីមុខតំណែង គណៈរដ្ឋមន្ត្រីថ្មីមួយត្រូវតែងតាំងជាបន្ទាន់ ក្នុងលក្ខខណ្ឌដែលមានចែងក្នុងរដ្ឋធម្មនុញ្ញនេះ។ ប្រធានរដ្ឋសភាត្រូវកោះប្រជុំរដ្ឋសភាជាបន្ទាន់ និងត្រូវធ្វើចំណាត់ការចាំបាច់ដទៃទៀតដោយរួសរាន់ ក្នុងរយៈវេលា៧ ថ្ងៃយ៉ាងយូរ បន្ទាប់ពីបានទទួលសំណើពីគណបក្សដែលមានអាសនៈច្រើនជាងគេក្នុងរដ្ឋសភា។\n\nក្នុងករណីតំណែងនាយករដ្ឋមន្ត្រីនៅទំនេរជាស្ថាពរដោយហេតុមកពីការទទួលអនិច្ចកម្ម គណៈរដ្ឋមន្ត្រីដែលត្រូវចេញពីតំណែង ក្រោមការដឹកនាំរបស់ឧបនាយករដ្ឋមន្ត្រីដែលទទួលបានការចាត់តាំងជានាយករដ្ឋមន្ត្រីស្ដីទី មានតែភារកិច្ចដឹកនាំការងារប្រចាំថ្ងៃតែប៉ុណ្ណោះ រហូតដល់មានគណៈរដ្ឋមន្ត្រីថ្មីចូលកាន់តំណែង។\n\nការលាលែងពីមុខតំណែងរបស់នាយករដ្ឋមន្ត្រី ត្រូវធ្វើឡើងតាមលិខិតលាលែងពីមុខតំណែងដែលត្រូវផ្ញើថ្វាយព្រះមហាក្សត្រ និងចម្លងជូនប្រធានរដ្ឋសភា។ ក្នុងករណីនេះ គណៈរដ្ឋមន្ត្រីដែលត្រូវចេញពីតំណែង ត្រូវបន្តដឹកនាំការងាររបស់រាជរដ្ឋាភិបាល រហូតដល់គណៈរដ្ឋមន្ត្រីថ្មីចូលកាន់តំណែង។"
      , referenceNumber = 32
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 126
      , isNew = True
      , content = "សមាជិកមួយរូបៗ នៃរាជរដ្ឋាភិបាល ត្រូវទទួលទណ្ឌកម្ម ពីបទឧក្រិដ្ឋ ឬបទមជ្ឈិម ដែលខ្លួនបានប្រព្រឹត្តក្នុងការបំពេញការងាររបស់ខ្លួន។\n\nក្នុងករណីនេះ និងក្នុងករណីធ្វើខុសជាទម្ងន់ក្នុងការបំពេញការងាររបស់ខ្លួន រដ្ឋសភាអាចសម្រេចប្តឹងទៅតុលាការមានសមត្ថកិច្ច។\n\nរដ្ឋសភាសម្រេចក្នុងរឿងនេះ ដោយវិធីបោះឆ្នោតជាសម្ងាត់តាមមតិភាគច្រើន\u{200B}ដាច់ខាតនៃសមាជិករដ្ឋសភាទាំងមូល។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 127
      , isNew = True
      , content = "ការរៀបចំនិងការប្រព្រឹត្តទៅនៃគណៈរដ្ឋមន្ត្រី នឹងត្រូវកំណត់ក្នុងច្បាប់មួយ។"
      , referenceNumber = 0
      , chapterIndex = 10
      , tags = [ "🚧" ]
      }
    , { index = 128
      , isNew = True
      , content = "អំណាចតុលាការជាអំណាចឯករាជ្យ។\n\nអំណាចតុលាការ ធានារក្សាអនាគត និងការពារសិទ្ធិ សេរីភាព របស់ប្រជាពលរដ្ឋ។\n\nអំណាចតុលាការគ្របដណ្តប់ទៅលើរឿងក្តីទាំងអស់ រួមទាំងរឿងក្តីរដ្ឋបាល\u{200B}ផង។\n\nអំណាចនេះ ត្រូវប្រគល់ឱ្យតុលាការកំពូល និងសាលាជម្រះក្តីគ្រប់ផ្នែក និងគ្រប់ជាន់ថ្នាក់។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 129
      , isNew = True
      , content = "ការជម្រះក្ដីផ្ដល់យុត្តិធម៌ ត្រូវធ្វើក្នុងនាមប្រជារាស្ត្រខ្មែរ តាមនីតិវិធី និងច្បាប់ជាធរមាន។\n\nមានតែចៅក្រមទេដែលមានសិទ្ធិជម្រះក្តី។ ចៅក្រមត្រូវបំពេញភារកិច្ចនេះ ដោយគោរពច្បាប់យ៉ាងម៉ឺងម៉ាត់ និងឱ្យអស់ពីដួងចិត្ត និងសម្បជញ្ញៈរបស់ខ្លួន។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 130
      , isNew = True
      , content = "គ្មានអង្គការណាមួយនៃអំណាចនីតិប្បញ្ញត្តិ ឬនីតិប្រតិបត្តិអាច ទទួលអំណា\u{200B}ចតុលាការអ្វីបានឡើយ។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 131
      , isNew = True
      , content = "មានតែអង្គការអយ្យការទេ ដែលមានសិទ្ធិធ្វើបណ្តឹងអាជ្ញា។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 132
      , isNew = True
      , content = "ព្រះមហាក្សត្រទ្រង់ជាអ្នកធានាឯករាជ្យនៃអំណាចតុលាការ។ ឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រមជួយព្រះមហាក្សត្រក្នុងកិច្ចការនេះ។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 133
      , isNew = True
      , content = "ចៅក្រមមិនអាចត្រូវគេដកពីមុខងារបានទេ។ ប៉ុន្តែឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម សម្រេចដាក់វិន័យលើចៅក្រមដែលបានប្រព្រឹត្តខុស។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 134
      , isNew = True
      , content = "ឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម នឹងត្រូវបង្កើតដោយច្បាប់រៀបចំអង្គការមួយ ដែលនឹងកំណត់សមាសភាពនិងមុខងារ។\n\nឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រមស្ថិតក្រោមព្រះរាជាធិបតីភាព នៃព្រះមហា\u{200B}ក្សត្រ។ ព្រះមហាក្សត្រ ព្រះអង្គទ្រង់អាចចាត់តាំងព្រះរាជតំណាងម្នាក់\u{200B}របស់ព្រះអង្គឱ្យធ្វើជាអធិបតីនៃឧត្តមក្រុមប្រឹក្សា នៃអង្គចៅក្រមនេះ។\n\nឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម លើកសេចក្តីស្នើថ្វាយព្រះមហាក្សត្រ អំពីការតែងតាំងចៅក្រម និងព្រះរាជអាជ្ញាអមសាលាជម្រះក្តីទាំងអស់។\n\nឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម ក្នុងមុខការដាក់វិន័យ ចំពោះចៅក្រម និងព្រះរាជអាជ្ញាត្រូវប្រជុំក្រោមអធិបតីភាពនៃប្រធានតុលាការ\u{200B}កំពូល ឬអគ្គព្រះរាជអាជ្ញាអមតុលាការកំពូល អាស្រ័យដោយករណីទាក់ទងនឹងចៅ\u{200B}ក្រម ឬព្រះរាជអាជ្ញា។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 135
      , isNew = True
      , content = "លក្ខន្តិកៈនៃចៅក្រម និងព្រះរាជអាជ្ញា និងការរៀបចំអង្គការតុលាការ នឹងត្រូវកំណត់ក្នុងច្បាប់ដោយឡែកពីគ្នា។"
      , referenceNumber = 0
      , chapterIndex = 11
      , tags = [ "🚧" ]
      }
    , { index = 136
      , isNew = True
      , content = "ក្រុមប្រឹក្សាធម្មនុញ្ញមានសមត្ថកិច្ចធានាការពារ ការគោរពរដ្ឋធម្មនុញ្ញ បកស្រាយរដ្ឋធម្មនុញ្ញ និងច្បាប់ដែលរដ្ឋសភាបានអនុម័ត និងព្រឹទ្ធសភាបានពិនិត្យចប់សព្វគ្រប់ហើយ។\n\nក្រុមប្រឹក្សាធម្មនុញ្ញមានសិទ្ធិពិនិត្យនិងសម្រេចអំពីករណីវិវាទកម្ម ទាក់\u{200B}ទង\u{200B}នឹងការបោះឆ្នោតជ្រើសតាំងតំណាងរាស្ត្រ និងការបោះឆ្នោតជ្រើសតាំងសមាជិកព្រឹទ្ធសភា។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 137
      , isNew = True
      , content = "ក្រុមប្រឹក្សាធម្មនុញ្ញ មានសមាជិកប្រាំបួនរូប ដែលទទួលអាណត្តិប្រាំបួនឆ្នាំ។ សមាជិកក្រុមប្រឹក្សាធម្មនុញ្ញចំនួនមួយភាគបី ត្រូវផ្លាស់ថ្មីក្នុងរយៈពេល\u{200B}\u{200B}\u{200B}បីឆ្នាំម្តង បីឆ្នាំម្តង។ សមាជិកបីរូប ត្រូវតែងតាំងដោយ\u{200B}ព្រះមហាក្សត្រ បីរូបត្រូវជ្រើសតាំងដោយរដ្ឋសភា ហើយបីរូបទៀត ត្រូវតែងតាំងដោយឧត្តមក្រុមប្រឹក្សានៃអង្គចៅក្រម។\n\nប្រធានត្រូវបានជ្រើសតាំងដោយសមាជិកក្រុមប្រឹក្សាធម្មនុញ្ញ ពីក្នុងចំណោមសមាជិកក្រុមប្រឹក្សាធម្មនុញ្ញដែលមានសញ្ជាតិខ្មែរពីកំណើត និងមានសញ្ជាតិខ្មែរតែមួយគត់[36]។ ប្រធានមានសំឡេងឧត្តមានុភាព ក្នុងករណីបែកសំឡេងជាពីរស្មើគ្នា។"
      , referenceNumber = 35
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 138
      , isNew = True
      , content = "សមាជិកក្រុមប្រឹក្សាធម្មនុញ្ញ ត្រូវជ្រើសរើសក្នុងចំណោមឥស្សរជន ដែលមានសញ្ញាបត្រចាប់ពីឧត្តមសិក្សាទៅខាងច្បាប់ ខាងរដ្ឋបាល ខាងការទូត ឬខាងសេដ្ឋកិច្ច ហើយមានពិសោធន៍ច្រើនក្នុងការងារ។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 139
      , isNew = True
      , content = "មុខងារសមាជិកក្រុមប្រឹក្សាធម្មនុញ្ញ មានវិសមិតភាព នឹងមុខងារ សមាជិក\u{200B}\u{200B}ព្រឹទ្ធសភា សមាជិករដ្ឋសភា សមាជិករាជរដ្ឋាភិបាល ចៅក្រមក្នុងតំណែង ការកាន់តំណែងណាមួយក្នុងមុខងារសាធារណៈ ប្រធាន ឬអនុប្រធាន គណបក្សនយោបាយ ប្រធាន ឬអនុប្រធានសហជីព។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 140
      , isNew = True
      , content = "ព្រះមហាក្សត្រ នាយករដ្ឋមន្ត្រី ប្រធានរដ្ឋសភា តំណាងរាស្ត្រ ចំនួនមួយភាគដប់ ប្រធានព្រឹទ្ធសភា ឬសមាជិកព្រឹទ្ធសភា ចំនួនមួយភាគបួន អាចបញ្ជូនច្បាប់ដែលរដ្ឋសភាបានអនុម័តទៅឱ្យក្រុមប្រឹក្សាធម្មនុញ្ញ ពិនិត្យ មុន\u{200B}\u{200B}នឹងច្បាប់នោះ ត្រូវប្រកាសឱ្យប្រើ។\n\nបទបញ្ជាផ្ទៃក្នុងរដ្ឋសភា បទបញ្ជាផ្ទៃក្នុងព្រឹទ្ធសភា និងច្បាប់រៀបចំអង្គការទាំងឡាយ ត្រូវតែបញ្ជូនទៅក្រុមប្រឹក្សាធម្មនុញ្ញ ពិនិត្យមុននឹងប្រកាសឱ្យប្រើ។ ក្រុមប្រឹក្សាធម្មនុញ្ញ ត្រូវសម្រេចក្នុងរយៈពេលសាមសិប (៣០) ថ្ងៃ យ៉ាងយូរថាតើច្បាប់ បទបញ្ជាផ្ទៃក្នុងរដ្ឋសភា និងបទបញ្ជាផ្ទៃក្នុងព្រឹទ្ធ\u{200B}សភា\u{200B}ខាងលើ ស្រប ឬ មិនស្របនឹងរដ្ឋធម្មនុញ្ញ។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 141
      , isNew = True
      , content = "ក្រោយពីច្បាប់ណាមួយត្រូវបានប្រកាសឱ្យប្រើ ព្រះមហាក្សត្រ ប្រធានព្រឹទ្ធសភា ប្រធានរដ្ឋសភា នាយករដ្ឋមន្ត្រី សមាជិកព្រឹទ្ធសភាចំនួនមួយភាគបួន តំណាងរាស្ត្រចំនួនមួយភាគដប់ ឬតុលាការ អាចសុំឱ្យក្រុម ប្រឹក្សាធម្មនុញ្ញពិនិត្យអំពីធម្មនុញ្ញភាព នៃច្បាប់នោះ។\n\nប្រជារាស្ត្រមានសិទ្ធិប្តឹងអំពីធម្មនុញ្ញភាព នៃច្បាប់បានតាមរយៈតំណាង\u{200B}រាស្ត្រ ឬប្រធានរដ្ឋសភា ឬសមាជិកព្រឹទ្ធសភា ឬប្រធានព្រឹទ្ធសភា ដូចមានចែងក្នុងវាក្យខ័ណ្ឌខាងលើ។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 142
      , isNew = True
      , content = "បទប្បញ្ញត្តិក្នុងមាត្រាណាដែលក្រុមប្រឹក្សាធម្មនុញ្ញប្រកាសថា មិនស្របនឹង\u{200B}រដ្ឋធម្មនុញ្ញ មិនអាចយកទៅប្រកាសឱ្យប្រើ ឬយកទៅអនុវត្តបានឡើយ។\n\nសេចក្តីសម្រេចរបស់ក្រុមប្រឹក្សាធម្មនុញ្ញ ជាសេចក្តីសម្រេចបិទផ្លូវតវ៉ា។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 143
      , isNew = True
      , content = "ព្រះមហាក្សត្រទ្រង់ពិគ្រោះមតិក្រុមប្រឹក្សាធម្មនុញ្ញ ចំពោះសេចក្តីស្នើទាំង ឡាយ ដែលសុំធ្វើវិសោធនកម្មលើរដ្ឋធម្មនុញ្ញ។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 144
      , isNew = True
      , content = "ច្បាប់រៀបចំអង្គការមួយ នឹងកំណត់ការរៀបចំ និងការប្រព្រឹត្តទៅនៃក្រុមប្រឹក្សាធម្មនុញ្ញ។"
      , referenceNumber = 0
      , chapterIndex = 12
      , tags = [ "🚧" ]
      }
    , { index = 145
      , isNew = True
      , content = "ទឹកដីនៃព្រះរាជាណាចក្រកម្ពុជាចែកជា រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ឃុំ សង្កាត់។"
      , referenceNumber = 38
      , chapterIndex = 13
      , tags = [ "🚧" ]
      }
    , { index = 146
      , isNew = True
      , content = "រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ឃុំ សង្កាត់ ត្រូវគ្រប់គ្រងតាមល័ក្ខខ័ណ្ឌដែលមានចែងក្នុងច្បាប់រៀបចំអង្គការ។"
      , referenceNumber = 39
      , chapterIndex = 13
      , tags = [ "🚧" ]
      }
    , { index = 147
      , isNew = True
      , content = "សមាជជាតិបើកឱ្យប្រជារាស្រ្ត\u{200B}ជ្រាប\u{200B}ដោយ\u{200B}ផ្ទាល់ អំពីកិច្ចការផ្សេងៗ ដែលជា\u{200B}\u{200B}ប្រយោជន៍\u{200B}ជាតិ និងលើកបញ្ហា និងសំណូមពរជូនរដ្ឋអំណាច ដោះស្រាយ។\n\nប្រជារាស្ត្រខ្មែរទាំងពីរភេទ មានសិទ្ធិទៅចូលរួមក្នុងសមាជជាតិ។"
      , referenceNumber = 0
      , chapterIndex = 14
      , tags = [ "🚧" ]
      }
    , { index = 148
      , isNew = True
      , content = "សមាជជាតិប្រជុំមួយដងក្នុងមួយឆ្នាំ នៅដើមខែធ្នូ តាមការកោះអញ្ជើញរបស់នាយករដ្ឋមន្ត្រី។\n\nសមាជជាតិប្រព្រឹត្តទៅក្រោមព្រះរាជាធិបតីភាព នៃព្រះមហាក្សត្រ។ មាត្រា ១៤៩.- ថ្មី\n\nសមាជជាតិ អនុម័តសំណូមពរជូនព្រឹទ្ធសភា ជូនរដ្ឋសភា និងជូនរដ្ឋអំណាចពិចារណា។\n\nការរៀបចំនិងការប្រព្រឹត្តទៅនៃសមាជជាតិ នឹងត្រូវកំណត់ក្នុងច្បាប់មួយ។"
      , referenceNumber = 0
      , chapterIndex = 14
      , tags = [ "🚧" ]
      }
    , { index = 150
      , isNew = True
      , content = "គណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោត គឺជាអង្គការ ដែលមានសមត្ថកិច្ចរៀបចំចាត់ចែង និងគ្រប់គ្រងការបោះឆ្នោតជ្រើសតាំងសមាជិកព្រឹទ្ធ-\u{200B}សភា និងការបោះឆ្នោតជ្រើសតាំងតំណាងរាស្ត្រ ព្រមទាំងការបោះឆ្នោតផ្សេងទៀត តាម\u{200B}ការកំណត់នៃច្បាប់។\n\nគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោត ត្រូវអនុវត្តសមត្ថកិច្ចរបស់ខ្លួន ប្រកបដោយឯករាជ្យ និងអព្យាក្រឹត ដើម្បីធានាឲ្យការបោះឆ្នោតប្រព្រឹត្តទៅ\u{200B}ដោយសេរី ត្រឹមត្រូវ និងយុត្តិធម៌ ស្របតាមគោលការណ៍នៃលទ្ធិប្រជាធិបតេយ្យ សេរីពហុបក្ស។\n\nមុខងារជាសមាជិកគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោត មានវិស-មិត\u{200B}ភាពជាមួយការបំពេញមុខតំណែងក្នុងមុខងារសាធារណៈ និងជាមួយមុខងារជាសមាជិកនៃស្ថាប័នដទៃទៀត ដែលមានចែងក្នុង រដ្ឋធម្មនុញ្ញនេះ។ សមាជិកគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោតមិនអាចធ្វើជាសមាជិកនៃគណបក្សនយោបាយ ឬធ្វើជាអ្នកដឹកនាំនៃអង្គការ មិនមែន\u{200B}រដ្ឋាភិបាល សមាគម សហជីព ឬក្រុមហ៊ុនពាណិជ្ជកម្មណាមួយបានឡើយ។\n\nគណៈកម្មាធិការ\u{200B}ជាតិ\u{200B}រៀប\u{200B}ចំការ\u{200B}បោះឆ្នោត មានថវិកាស្វយ័ត សម្រាប់ដំណើរការ។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 151
      , isNew = True
      , content = "គណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោត មានសមាស ភាពប្រាំបួនរូបដែលទទួលអាណត្តិប្រាំឆ្នាំ។ សមាសភាពបួនរូបត្រូវជ្រើសរើសដោយគណ\u{200B}បក្ស\u{200B}ដឹកនាំរាជរដ្ឋាភិបាលបួនរូប ត្រូវជ្រើសរើសដោយគណបក្សមាន\u{200B}អាសនៈក្នុងរដ្ឋសភាដែលមិនចូលរួមក្នុងរាជរដ្ឋាភិបាល និងមួយរូប ត្រូវជ្រើសរើសដោយមានការព្រមព្រៀងគ្នារវាងគណបក្សទាំងអស់ដែលមាន\u{200B}អាសនៈក្នុងរដ្ឋសភា។\n\nគណៈកម្មាធិការអចិន្ត្រៃយ៍រដ្ឋសភា ត្រូវដំណើរការរៀបចំឲ្យមានការជ្រើស\u{200B}រើសដោយបើកចំហ និងតម្លាភាព នូវសមាសភាពគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោត។ គណៈកម្មាធិការអចិន្ត្រៃយ៍រដ្ឋសភា រៀបចំ បញ្ជីសមាសភាពគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោតដាក់ជូនរដ្ឋសភា ដើម្បីបោះឆ្នោតទុកចិត្តតាមមតិភាគច្រើនដាច់ខាត នៃចំនួនសមាជិករដ្ឋសភា ទាំងមូល។\n\nសមាសភាពគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោតត្រូវ តែងតាំងដោយ\u{200B}ព្រះរាជក្រឹត្យ។\n\nក្នុងករណីសមាជិកណាមួយនៃគណៈកម្មាធិការជាតិរៀបចំ ការបោះឆ្នោត បាត់បង់សមាជិកភាពរបស់ខ្លួន គណៈកម្មាធិការអចិន្ត្រៃយ៍រដ្ឋសភាត្រូវចាត់ នីតិវិធីជ្រើសរើស សមាសភាពថ្មីជំនួស ក្នុងរយៈពេលយ៉ាង យូរ ១៥ ថ្ងៃគិតពីថ្ងៃបាត់បង់សមាជិកភាព។ នីតិវិធីលម្អិត\u{200B}នៃការជ្រើសរើស សមាស\u{200B}ភាពថ្មីជំនួស ត្រូវកំណត់ដោយឡែកក្នុងច្បាប់។\n\nក្នុងករណីដែលខកខានមិនបានរៀបចំសមាសភាពគណៈកម្មាធិការជាតិរៀប\u{200B}ចំការបោះឆ្នោត សមាសភាពគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោតដែលមានស្រាប់ ត្រូវអនុវត្តការងាររបស់ខ្លួនបន្តទៀត និងមាន\u{200B}សមត្ថ\u{200B}\u{200B}កិច្ចដើម្បីចាត់ចែងរៀបចំការបោះឆ្នោតតាមច្បាប់។\n\nការរៀបចំនិងការប្រព្រឹត្តទៅនៃគណៈកម្មាធិការជាតិរៀបចំការបោះឆ្នោត នឹងត្រូវកំណត់ក្នុងច្បាប់មួយ។\nជំពួកទី ១៦ ថ្មី (ពីរ)៖ អំពីអានុភាព ការសើរើ និងវិសោធនកម្មរដ្ឋធម្មនុញ្ញ[42]"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 152
      , isNew = True
      , content = "រដ្ឋធម្មនុញ្ញនេះជាច្បាប់កំពូល នៃព្រះរាជាណាចក្រកម្ពុជា។\n\nច្បាប់ និងសេចក្តីសម្រេចទាំងឡាយនៃស្ថាប័ននានារបស់រដ្ឋ ត្រូវស្របនឹងរដ្ឋធម្មនុញ្ញជាដាច់ខាត។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 153
      , isNew = True
      , content = "ការផ្តើមគំនិតសើរើ ឬការផ្តើមគំនិតធ្វើវិសោធនកម្មរដ្ឋធម្មនុញ្ញជាសិទ្ធិរបស់\u{200B}ព្រះមហាក្សត្រ របស់នាយករដ្ឋមន្ត្រី និងរបស់ប្រធានរដ្ឋសភា តាមសេច-ក្តីស្នើរបស់តំណាងរាស្ត្រមួយភាគបួន នៃចំនួនសមាជិករដ្ឋសភាទាំងមូល។\n\nការសើរើ ឬវិសោធនកម្មរដ្ឋធម្មនុញ្ញ ត្រូវធ្វើឡើងដោយច្បាប់ធម្មនុញ្ញមួយ ដែលអនុម័តដោយរដ្ឋសភា តាមមតិភាគច្រើនពីរភាគបី នៃចំនួនសមា\u{200B}ជិក\u{200B}រដ្ឋសភាទាំងមូល។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 154
      , isNew = True
      , content = "ការសើរើ ឬវិសោធនកម្មរដ្ឋធម្មនុញ្ញ ត្រូវហាមឃាត់មិនឲ្យធ្វើនៅពេលប្រទេសជាតិឋិតក្នុងភាពអាសន្ន ដូចមានចែងក្នុងមាត្រា ៨៦។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 155
      , isNew = True
      , content = "ការសើរើ ឬវិសោធនកម្មរដ្ឋធម្មនុញ្ញមិនអាចធ្វើបានឡើយ កាលបើប៉ះពាល់\u{200B}\u{200B}ដល់ប្រព័ន្ធប្រជាធិបតេយ្យ សេរីពហុបក្ស និងរបបរាជានិយមអាស្រ័យដោយរដ្ឋធម្មនុញ្ញ។\nជំពួកទី ១៧ ថ្មី៖ អំពីអន្តរប្បញ្ញត្តិ"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 156
      , isNew = True
      , content = "រដ្ឋធម្មនុញ្ញនេះ ក្រោយពីបានទទួលការអនុម័ត ត្រូវបានប្រកាសឲ្យចូលជាធរមានភ្លាម ដោយព្រះមហាក្សត្រ នៃព្រះរាជាណាចក្រកម្ពុជា។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 157
      , isNew = True
      , content = "ក្រោយពេលរដ្ឋធម្មនុញ្ញនេះចូលជាធរមាន សភាធម្មនុញ្ញ ត្រូវក្លាយទៅជារដ្ឋសភា។\n\nបទបញ្ជាផ្ទៃក្នុងរបស់រដ្ឋសភាត្រូវចូលជាធរមាន ក្រោយទទួលបានការអនុម័ត\u{200B}ពីរដ្ឋសភា។\n\nក្នុងករណីដែលរដ្ឋសភាមិនទាន់ចាប់ដំណើរការបាន ប្រធាន អនុប្រធានទីមួយ និង អនុប្រធានទីពីរ នៃសភាធម្មនុញ្ញ នឹងចូលរួមបំពេញ ភារកិច្ចក្នុងក្រុមប្រឹក្សារាជសម្បត្តិ បើសភាពការណ៍ក្នុងប្រទេសទាមទារ។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 158
      , isNew = True
      , content = "ក្រោយរដ្ឋធម្មនុញ្ញនេះចូលជាធរមាន ព្រះមហាក្សត្រជ្រើសតាំងតាមល័ក្ខខ័ណ្ឌដែលមានចែងក្នុងមាត្រា ១៣ ថ្មី និង ១៤។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 159
      , isNew = True
      , content = "នីតិកាលទី ១ នៃព្រឹទ្ធសភាមានកំណត់ ៥ ឆ្នាំ ហើយត្រូវផុត កំណត់នៅពេលព្រឹទ្ធសភា ថ្មីចូលកាន់តំណែង។\n\nសម្រាប់នីតិកាលទី ១ នៃព្រឹទ្ធសភា :\n\n    សមាជិកព្រឹទ្ធសភាមានចំនួនសរុបហុកសិបមួយរូប។\n    ព្រះមហាក្សត្រទ្រង់តែងតាំងសមាជិកព្រឹទ្ធសភាពីររូប ព្រមទាំងប្រធាន អនុប្រធានទី ១ អនុប្រធានទី ២ នៃព្រឹទ្ធសភា។\n    សមាជិកដទៃទៀតនៃព្រឹទ្ធសភា ត្រូវបានតែងតាំងដោយ ព្រះមហាក្សត្រ តាមសំណើរបស់ប្រធានព្រឹទ្ធសភា និងប្រធានរដ្ឋសភាក្នុងចំណោមសមា\u{200B}ជិក នៃគណបក្សដែលមានអាសនៈ នៅក្នុងរដ្ឋសភា។\n    កិច្ចប្រជុំជាសមាជរដ្ឋសភានិងព្រឹទ្ធសភា ត្រូវដឹកនាំដោយ សហប្រធាន។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    , { index = 160
      , isNew = True
      , content = "ច្បាប់ និងលិខិតបទដ្ឋានទាំងអស់នៅកម្ពុជា ដែលធានាការពារបាននូវទ្រព្យសម្បត្តិរដ្ឋ សិទ្ធិសេរីភាព និងទ្រព្យសម្បត្តិត្រឹមត្រូវតាមច្បាប់របស់បុគ្គល និងដែលសមស្របនឹងប្រយោជន៍ជាតិ ត្រូវមានអានុភាពអនុវត្តបន្តទៅមុខទៀត រហូតដល់មានអត្ថបទថ្មីមកកែប្រែ ឬលុបចោល លើក លែងតែបទប្បញ្ញត្តិណា ដែលផ្ទុយនឹងស្មារតីនៃរដ្ឋធម្មនុញ្ញនេះ។"
      , referenceNumber = 0
      , chapterIndex = 15
      , tags = [ "🚧" ]
      }
    ]
